[Killed] StringLiteral
src/game/input.ts:3:35
 import { Q } from './constants';
 type Vector = { x: number; y: number };
-const codes = new Set(['ArrowUp', 'ArrowDown', 'ArrowLeft', 'ArrowRight', 'KeyW', 'KeyA', 'KeyS', 'KeyD']);
+const codes = new Set(['ArrowUp', "", 'ArrowLeft', 'ArrowRight', 'KeyW', 'KeyA', 'KeyS', 'KeyD']);
 const zero = (): Vector => ({ x: 0, y: 0 });
 function keyboardVector(held: Set<string>): Vector {
killedBy: keyboard source behavior re-evaluates the complete supported-code table and zero vector
statusReason: expected { x: +0, y: +0 } to deeply equal { x: +0, y: 65536 }

[Killed] ArrayDeclaration
src/game/input.ts:3:23
 import { Q } from './constants';
 type Vector = { x: number; y: number };
-const codes = new Set(['ArrowUp', 'ArrowDown', 'ArrowLeft', 'ArrowRight', 'KeyW', 'KeyA', 'KeyS', 'KeyD']);
+const codes = new Set([]);
 const zero = (): Vector => ({ x: 0, y: 0 });
 function keyboardVector(held: Set<string>): Vector {
killedBy: keyboard source behavior re-evaluates the complete supported-code table and zero vector
statusReason: expected { x: +0, y: +0 } to deeply equal { x: +0, y: -65536 }

[Killed] ArrowFunction
src/game/input.ts:4:14
 import { Q } from './constants';
 type Vector = { x: number; y: number };
 const codes = new Set(['ArrowUp', 'ArrowDown', 'ArrowLeft', 'ArrowRight', 'KeyW', 'KeyA', 'KeyS', 'KeyD']);
-const zero = (): Vector => ({ x: 0, y: 0 });
+const zero = () => undefined;
 function keyboardVector(held: Set<string>): Vector {
   const x = (held.has('ArrowRight') || held.has('KeyD') ? 1 : 0) - (held.has('ArrowLeft') || held.has('KeyA') ? 1 : 0);
killedBy: keyboard source behavior re-evaluates the complete supported-code table and zero vector
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] ObjectLiteral
src/game/input.ts:4:29
 import { Q } from './constants';
 type Vector = { x: number; y: number };
 const codes = new Set(['ArrowUp', 'ArrowDown', 'ArrowLeft', 'ArrowRight', 'KeyW', 'KeyA', 'KeyS', 'KeyD']);
-const zero = (): Vector => ({ x: 0, y: 0 });
+const zero = (): Vector => ({});
 function keyboardVector(held: Set<string>): Vector {
   const x = (held.has('ArrowRight') || held.has('KeyD') ? 1 : 0) - (held.has('ArrowLeft') || held.has('KeyA') ? 1 : 0);
killedBy: mutation-gap input contracts recognizes every supported code: ArrowUp
statusReason: expected {} to deeply equal { x: +0, y: +0 }

[Killed] BlockStatement
src/game/input.ts:5:52
 type Vector = { x: number; y: number };
 const codes = new Set(['ArrowUp', 'ArrowDown', 'ArrowLeft', 'ArrowRight', 'KeyW', 'KeyA', 'KeyS', 'KeyD']);
 const zero = (): Vector => ({ x: 0, y: 0 });
-function keyboardVector(held: Set<string>): Vector {
-  const x = (held.has('ArrowRight') || held.has('KeyD') ? 1 : 0) - (held.has('ArrowLeft') || held.has('KeyA') ? 1 : 0);
-  const y = (held.has('ArrowDown') || held.has('KeyS') ? 1 : 0) - (held.has('ArrowUp') || held.has('KeyW') ? 1 : 0);
-  if (!x && !y) return zero();
-  return x && y ? { x: x * 46_341, y: y * 46_341 } : { x: x * Q, y: y * Q };
-}
+function keyboardVector(held: Set<string>): Vector {}
 export function createInputController() {
   const held = new Set<string>(); let touch = zero(); let keyboardSequence = 0; let touchSequence = 0; let sequence = 0;
killedBy: mutation-gap input contracts recognizes every supported code: ArrowUp
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] ConditionalExpression
src/game/input.ts:6:69
 const codes = new Set(['ArrowUp', 'ArrowDown', 'ArrowLeft', 'ArrowRight', 'KeyW', 'KeyA', 'KeyS', 'KeyD']);
 const zero = (): Vector => ({ x: 0, y: 0 });
 function keyboardVector(held: Set<string>): Vector {
-  const x = (held.has('ArrowRight') || held.has('KeyD') ? 1 : 0) - (held.has('ArrowLeft') || held.has('KeyA') ? 1 : 0);
+  const x = (held.has('ArrowRight') || held.has('KeyD') ? 1 : 0) - (true ? 1 : 0);
   const y = (held.has('ArrowDown') || held.has('KeyS') ? 1 : 0) - (held.has('ArrowUp') || held.has('KeyW') ? 1 : 0);
   if (!x && !y) return zero();
killedBy: mutation-gap input contracts recognizes every supported code: ArrowUp
statusReason: expected { x: -46341, y: -46341 } to deeply equal { x: +0, y: -65536 }

[Killed] ArithmeticOperator
src/game/input.ts:6:13
 const codes = new Set(['ArrowUp', 'ArrowDown', 'ArrowLeft', 'ArrowRight', 'KeyW', 'KeyA', 'KeyS', 'KeyD']);
 const zero = (): Vector => ({ x: 0, y: 0 });
 function keyboardVector(held: Set<string>): Vector {
-  const x = (held.has('ArrowRight') || held.has('KeyD') ? 1 : 0) - (held.has('ArrowLeft') || held.has('KeyA') ? 1 : 0);
+  const x = (held.has('ArrowRight') || held.has('KeyD') ? 1 : 0) + (held.has('ArrowLeft') || held.has('KeyA') ? 1 : 0);
   const y = (held.has('ArrowDown') || held.has('KeyS') ? 1 : 0) - (held.has('ArrowUp') || held.has('KeyW') ? 1 : 0);
   if (!x && !y) return zero();
killedBy: mutation-gap input contracts recognizes every supported code: ArrowLeft
statusReason: expected { x: 65536, y: +0 } to deeply equal { x: -65536, y: +0 }

[Killed] ConditionalExpression
src/game/input.ts:7:14
 const zero = (): Vector => ({ x: 0, y: 0 });
 function keyboardVector(held: Set<string>): Vector {
   const x = (held.has('ArrowRight') || held.has('KeyD') ? 1 : 0) - (held.has('ArrowLeft') || held.has('KeyA') ? 1 : 0);
-  const y = (held.has('ArrowDown') || held.has('KeyS') ? 1 : 0) - (held.has('ArrowUp') || held.has('KeyW') ? 1 : 0);
+  const y = (false ? 1 : 0) - (held.has('ArrowUp') || held.has('KeyW') ? 1 : 0);
   if (!x && !y) return zero();
   return x && y ? { x: x * 46_341, y: y * 46_341 } : { x: x * Q, y: y * Q };
killedBy: mutation-gap input contracts recognizes every supported code: ArrowDown
statusReason: expected { x: +0, y: +0 } to deeply equal { x: +0, y: 65536 }

[Killed] ConditionalExpression
src/game/input.ts:7:68
 const zero = (): Vector => ({ x: 0, y: 0 });
 function keyboardVector(held: Set<string>): Vector {
   const x = (held.has('ArrowRight') || held.has('KeyD') ? 1 : 0) - (held.has('ArrowLeft') || held.has('KeyA') ? 1 : 0);
-  const y = (held.has('ArrowDown') || held.has('KeyS') ? 1 : 0) - (held.has('ArrowUp') || held.has('KeyW') ? 1 : 0);
+  const y = (held.has('ArrowDown') || held.has('KeyS') ? 1 : 0) - (true ? 1 : 0);
   if (!x && !y) return zero();
   return x && y ? { x: x * 46_341, y: y * 46_341 } : { x: x * Q, y: y * Q };
killedBy: mutation-gap input contracts recognizes every supported code: ArrowUp
statusReason: expected { x: +0, y: -65536 } to deeply equal { x: +0, y: +0 }

[Killed] ConditionalExpression
src/game/input.ts:8:7
 function keyboardVector(held: Set<string>): Vector {
   const x = (held.has('ArrowRight') || held.has('KeyD') ? 1 : 0) - (held.has('ArrowLeft') || held.has('KeyA') ? 1 : 0);
   const y = (held.has('ArrowDown') || held.has('KeyS') ? 1 : 0) - (held.has('ArrowUp') || held.has('KeyW') ? 1 : 0);
-  if (!x && !y) return zero();
+  if (true) return zero();
   return x && y ? { x: x * 46_341, y: y * 46_341 } : { x: x * Q, y: y * Q };
 }
killedBy: mutation-gap input contracts recognizes every supported code: ArrowUp
statusReason: expected { x: +0, y: +0 } to deeply equal { x: +0, y: -65536 }

[Killed] BooleanLiteral
src/game/input.ts:8:13
 function keyboardVector(held: Set<string>): Vector {
   const x = (held.has('ArrowRight') || held.has('KeyD') ? 1 : 0) - (held.has('ArrowLeft') || held.has('KeyA') ? 1 : 0);
   const y = (held.has('ArrowDown') || held.has('KeyS') ? 1 : 0) - (held.has('ArrowUp') || held.has('KeyW') ? 1 : 0);
-  if (!x && !y) return zero();
+  if (!x && y) return zero();
   return x && y ? { x: x * 46_341, y: y * 46_341 } : { x: x * Q, y: y * Q };
 }
killedBy: mutation-gap input contracts recognizes every supported code: ArrowUp
statusReason: expected { x: +0, y: +0 } to deeply equal { x: +0, y: -65536 }

[Killed] LogicalOperator
src/game/input.ts:9:10
   const x = (held.has('ArrowRight') || held.has('KeyD') ? 1 : 0) - (held.has('ArrowLeft') || held.has('KeyA') ? 1 : 0);
   const y = (held.has('ArrowDown') || held.has('KeyS') ? 1 : 0) - (held.has('ArrowUp') || held.has('KeyW') ? 1 : 0);
   if (!x && !y) return zero();
-  return x && y ? { x: x * 46_341, y: y * 46_341 } : { x: x * Q, y: y * Q };
+  return x || y ? { x: x * 46_341, y: y * 46_341 } : { x: x * Q, y: y * Q };
 }
 export function createInputController() {
killedBy: mutation-gap input contracts recognizes every supported code: ArrowUp
statusReason: expected { x: +0, y: -46341 } to deeply equal { x: +0, y: -65536 }

[Killed] ArithmeticOperator
src/game/input.ts:9:24
   const x = (held.has('ArrowRight') || held.has('KeyD') ? 1 : 0) - (held.has('ArrowLeft') || held.has('KeyA') ? 1 : 0);
   const y = (held.has('ArrowDown') || held.has('KeyS') ? 1 : 0) - (held.has('ArrowUp') || held.has('KeyW') ? 1 : 0);
   if (!x && !y) return zero();
-  return x && y ? { x: x * 46_341, y: y * 46_341 } : { x: x * Q, y: y * Q };
+  return x && y ? { x: x / 46_341, y: y * 46_341 } : { x: x * Q, y: y * Q };
 }
 export function createInputController() {
killedBy: mutation-gap input contracts uses the latest nonzero source after each real source change
statusReason: expected { x: 0.000021579163160052653, …(1) } to deeply equal { x: 46341, y: -46341 }

[Killed] UpdateOperator
src/game/input.ts:13:54
 }
 export function createInputController() {
   const held = new Set<string>(); let touch = zero(); let keyboardSequence = 0; let touchSequence = 0; let sequence = 0;
-  const keyboardChanged = () => { keyboardSequence = ++sequence; };
+  const keyboardChanged = () => { keyboardSequence = --sequence; };
   return {
     keyDown(code: string) { if (codes.has(code) && !held.has(code)) { held.add(code); keyboardChanged(); } },
killedBy: mutation-gap input contracts uses the latest nonzero source after each real source change
statusReason: expected { x: -65536, y: +0 } to deeply equal { x: 46341, y: -46341 }

[Killed] BlockStatement
src/game/input.ts:13:33
 }
 export function createInputController() {
   const held = new Set<string>(); let touch = zero(); let keyboardSequence = 0; let touchSequence = 0; let sequence = 0;
-  const keyboardChanged = () => { keyboardSequence = ++sequence; };
+  const keyboardChanged = () => {};
   return {
     keyDown(code: string) { if (codes.has(code) && !held.has(code)) { held.add(code); keyboardChanged(); } },
killedBy: mutation-gap input contracts uses the latest nonzero source after each real source change
statusReason: expected { x: -65536, y: +0 } to deeply equal { x: 46341, y: -46341 }

[Killed] LogicalOperator
src/game/input.ts:15:33
   const held = new Set<string>(); let touch = zero(); let keyboardSequence = 0; let touchSequence = 0; let sequence = 0;
   const keyboardChanged = () => { keyboardSequence = ++sequence; };
   return {
-    keyDown(code: string) { if (codes.has(code) && !held.has(code)) { held.add(code); keyboardChanged(); } },
+    keyDown(code: string) { if (codes.has(code) || !held.has(code)) { held.add(code); keyboardChanged(); } },
     keyUp(code: string) { if (codes.has(code) && held.delete(code)) keyboardChanged(); },
     setTouch(vector: Vector) { touch = vector; touchSequence = ++sequence; },
killedBy: keyboard source behavior does not let unsupported or repeated keys steal source priority
statusReason: expected { x: -65536, y: +0 } to deeply equal { x: 65536, y: +0 }

[Killed] ConditionalExpression
src/game/input.ts:15:33
   const held = new Set<string>(); let touch = zero(); let keyboardSequence = 0; let touchSequence = 0; let sequence = 0;
   const keyboardChanged = () => { keyboardSequence = ++sequence; };
   return {
-    keyDown(code: string) { if (codes.has(code) && !held.has(code)) { held.add(code); keyboardChanged(); } },
+    keyDown(code: string) { if (false) { held.add(code); keyboardChanged(); } },
     keyUp(code: string) { if (codes.has(code) && held.delete(code)) keyboardChanged(); },
     setTouch(vector: Vector) { touch = vector; touchSequence = ++sequence; },
killedBy: mutation-gap input contracts recognizes every supported code: ArrowUp
statusReason: expected { x: +0, y: +0 } to deeply equal { x: +0, y: -65536 }

[Killed] BlockStatement
src/game/input.ts:16:25
   const keyboardChanged = () => { keyboardSequence = ++sequence; };
   return {
     keyDown(code: string) { if (codes.has(code) && !held.has(code)) { held.add(code); keyboardChanged(); } },
-    keyUp(code: string) { if (codes.has(code) && held.delete(code)) keyboardChanged(); },
+    keyUp(code: string) {},
     setTouch(vector: Vector) { touch = vector; touchSequence = ++sequence; },
     releaseTouch() { if (touch.x || touch.y) { touch = zero(); touchSequence = ++sequence; } },
killedBy: mutation-gap input contracts recognizes every supported code: ArrowUp
statusReason: expected { x: +0, y: -65536 } to deeply equal { x: +0, y: +0 }

[Killed] LogicalOperator
src/game/input.ts:16:31
   const keyboardChanged = () => { keyboardSequence = ++sequence; };
   return {
     keyDown(code: string) { if (codes.has(code) && !held.has(code)) { held.add(code); keyboardChanged(); } },
-    keyUp(code: string) { if (codes.has(code) && held.delete(code)) keyboardChanged(); },
+    keyUp(code: string) { if (codes.has(code) || held.delete(code)) keyboardChanged(); },
     setTouch(vector: Vector) { touch = vector; touchSequence = ++sequence; },
     releaseTouch() { if (touch.x || touch.y) { touch = zero(); touchSequence = ++sequence; } },
killedBy: mutation-gap input contracts recognizes every supported code: ArrowUp
statusReason: expected { x: +0, y: -65536 } to deeply equal { x: +0, y: +0 }

[Killed] UpdateOperator
src/game/input.ts:17:64
   return {
     keyDown(code: string) { if (codes.has(code) && !held.has(code)) { held.add(code); keyboardChanged(); } },
     keyUp(code: string) { if (codes.has(code) && held.delete(code)) keyboardChanged(); },
-    setTouch(vector: Vector) { touch = vector; touchSequence = ++sequence; },
+    setTouch(vector: Vector) { touch = vector; touchSequence = --sequence; },
     releaseTouch() { if (touch.x || touch.y) { touch = zero(); touchSequence = ++sequence; } },
     clear() { held.clear(); touch = zero(); keyboardSequence = ++sequence; touchSequence = sequence; },
killedBy: mutation-gap input contracts uses the latest nonzero source after each real source change
statusReason: expected { x: 65536, y: +0 } to deeply equal { x: -65536, y: +0 }

[Killed] BlockStatement
src/game/input.ts:17:30
   return {
     keyDown(code: string) { if (codes.has(code) && !held.has(code)) { held.add(code); keyboardChanged(); } },
     keyUp(code: string) { if (codes.has(code) && held.delete(code)) keyboardChanged(); },
-    setTouch(vector: Vector) { touch = vector; touchSequence = ++sequence; },
+    setTouch(vector: Vector) {},
     releaseTouch() { if (touch.x || touch.y) { touch = zero(); touchSequence = ++sequence; } },
     clear() { held.clear(); touch = zero(); keyboardSequence = ++sequence; touchSequence = sequence; },
killedBy: mutation-gap input contracts uses the latest nonzero source after each real source change
statusReason: expected { x: 65536, y: +0 } to deeply equal { x: -65536, y: +0 }

[Killed] LogicalOperator
src/game/input.ts:18:26
     keyDown(code: string) { if (codes.has(code) && !held.has(code)) { held.add(code); keyboardChanged(); } },
     keyUp(code: string) { if (codes.has(code) && held.delete(code)) keyboardChanged(); },
     setTouch(vector: Vector) { touch = vector; touchSequence = ++sequence; },
-    releaseTouch() { if (touch.x || touch.y) { touch = zero(); touchSequence = ++sequence; } },
+    releaseTouch() { if (touch.x && touch.y) { touch = zero(); touchSequence = ++sequence; } },
     clear() { held.clear(); touch = zero(); keyboardSequence = ++sequence; touchSequence = sequence; },
     interrupt(reason: 'pause' | 'visibility' | 'blur' | 'terminal') { void reason; held.clear(); touch = zero(); keyboardSequence = ++sequence; touchSequence = sequence; },
killedBy: shared keyboard/touch input arbitration lets the most recently changed non-zero source win and falls back on release
statusReason: expected { x: 65536, y: +0 } to deeply equal { x: -65536, y: +0 }

[Killed] ConditionalExpression
src/game/input.ts:18:26
     keyDown(code: string) { if (codes.has(code) && !held.has(code)) { held.add(code); keyboardChanged(); } },
     keyUp(code: string) { if (codes.has(code) && held.delete(code)) keyboardChanged(); },
     setTouch(vector: Vector) { touch = vector; touchSequence = ++sequence; },
-    releaseTouch() { if (touch.x || touch.y) { touch = zero(); touchSequence = ++sequence; } },
+    releaseTouch() { if (false) { touch = zero(); touchSequence = ++sequence; } },
     clear() { held.clear(); touch = zero(); keyboardSequence = ++sequence; touchSequence = sequence; },
     interrupt(reason: 'pause' | 'visibility' | 'blur' | 'terminal') { void reason; held.clear(); touch = zero(); keyboardSequence = ++sequence; touchSequence = sequence; },
killedBy: shared keyboard/touch input arbitration lets the most recently changed non-zero source win and falls back on release
statusReason: expected { x: 65536, y: +0 } to deeply equal { x: -65536, y: +0 }

[Killed] BlockStatement
src/game/input.ts:19:13
     keyUp(code: string) { if (codes.has(code) && held.delete(code)) keyboardChanged(); },
     setTouch(vector: Vector) { touch = vector; touchSequence = ++sequence; },
     releaseTouch() { if (touch.x || touch.y) { touch = zero(); touchSequence = ++sequence; } },
-    clear() { held.clear(); touch = zero(); keyboardSequence = ++sequence; touchSequence = sequence; },
+    clear() {},
     interrupt(reason: 'pause' | 'visibility' | 'blur' | 'terminal') { void reason; held.clear(); touch = zero(); keyboardSequence = ++sequence; touchSequence = sequence; },
killedBy: shared keyboard/touch input arbitration lets the most recently changed non-zero source win and falls back on release
statusReason: expected { x: -65536, y: +0 } to deeply equal { x: +0, y: +0 }

[Survived] UpdateOperator
src/game/input.ts:19:64
     keyUp(code: string) { if (codes.has(code) && held.delete(code)) keyboardChanged(); },
     setTouch(vector: Vector) { touch = vector; touchSequence = ++sequence; },
     releaseTouch() { if (touch.x || touch.y) { touch = zero(); touchSequence = ++sequence; } },
-    clear() { held.clear(); touch = zero(); keyboardSequence = ++sequence; touchSequence = sequence; },
+    clear() { held.clear(); touch = zero(); keyboardSequence = --sequence; touchSequence = sequence; },
     interrupt(reason: 'pause' | 'visibility' | 'blur' | 'terminal') { void reason; held.clear(); touch = zero(); keyboardSequence = ++sequence; touchSequence = sequence; },

[Killed] BlockStatement
src/game/input.ts:20:69
     setTouch(vector: Vector) { touch = vector; touchSequence = ++sequence; },
     releaseTouch() { if (touch.x || touch.y) { touch = zero(); touchSequence = ++sequence; } },
     clear() { held.clear(); touch = zero(); keyboardSequence = ++sequence; touchSequence = sequence; },
-    interrupt(reason: 'pause' | 'visibility' | 'blur' | 'terminal') { void reason; held.clear(); touch = zero(); keyboardSequence = ++sequence; touchSequence = sequence; },
+    interrupt(reason: 'pause' | 'visibility' | 'blur' | 'terminal') {},
   };
killedBy: shared keyboard/touch input arbitration clears held input on pause, visibility, focus loss, and terminal transitions
statusReason: expected { x: 65536, y: +0 } to deeply equal { x: +0, y: +0 }

[Survived] UpdateOperator
src/game/input.ts:20:133
     setTouch(vector: Vector) { touch = vector; touchSequence = ++sequence; },
     releaseTouch() { if (touch.x || touch.y) { touch = zero(); touchSequence = ++sequence; } },
     clear() { held.clear(); touch = zero(); keyboardSequence = ++sequence; touchSequence = sequence; },
-    interrupt(reason: 'pause' | 'visibility' | 'blur' | 'terminal') { void reason; held.clear(); touch = zero(); keyboardSequence = ++sequence; touchSequence = sequence; },
+    interrupt(reason: 'pause' | 'visibility' | 'blur' | 'terminal') { void reason; held.clear(); touch = zero(); keyboardSequence = --sequence; touchSequence = sequence; },
   };
