[Killed] ArrowFunction
src/game/reducer.ts:6:16
 import { attemptStarRespawn } from './spawn';
 import type { GameEvent, GameState, Shadow, Transition, VectorQ } from './types';
 
-const trunc0 = (value: number) => (value < 0 ? Math.ceil(value) : Math.floor(value));
+const trunc0 = () => undefined;
 const distance = (a: VectorQ, b: VectorQ) => Math.hypot(a.x - b.x, a.y - b.y);
 const pixels = (a: VectorQ, b: VectorQ) => distance(a, b) / Q;
killedBy: world and reducer behavior re-evaluates reducer helper functions after module reset
statusReason: expected NaN to be 130971512 // Object.is equality

[Killed] ConditionalExpression
src/game/reducer.ts:6:36
 import { attemptStarRespawn } from './spawn';
 import type { GameEvent, GameState, Shadow, Transition, VectorQ } from './types';
 
-const trunc0 = (value: number) => (value < 0 ? Math.ceil(value) : Math.floor(value));
+const trunc0 = (value: number) => (false ? Math.ceil(value) : Math.floor(value));
 const distance = (a: VectorQ, b: VectorQ) => Math.hypot(a.x - b.x, a.y - b.y);
 const pixels = (a: VectorQ, b: VectorQ) => distance(a, b) / Q;
killedBy: mutation-gap reducer contracts moves shadows diagonally and increases pursuit speed after each five banked stars
statusReason: expected { x: 98232943, y: 72018543 } to deeply equal { x: 98232946, y: 72018546 }

[Killed] ArithmeticOperator
src/game/reducer.ts:7:68
 import type { GameEvent, GameState, Shadow, Transition, VectorQ } from './types';
 
 const trunc0 = (value: number) => (value < 0 ? Math.ceil(value) : Math.floor(value));
-const distance = (a: VectorQ, b: VectorQ) => Math.hypot(a.x - b.x, a.y - b.y);
+const distance = (a: VectorQ, b: VectorQ) => Math.hypot(a.x - b.x, a.y + b.y);
 const pixels = (a: VectorQ, b: VectorQ) => distance(a, b) / Q;
 const unit = (from: VectorQ, to: VectorQ, id = 0): VectorQ => {
killedBy: fixed-step reducer contract applies a lit-lantern repel once after pursuit and resets grace
statusReason: expected +0 to be 21 // Object.is equality

[Killed] ArrowFunction
src/game/reducer.ts:7:18
 import type { GameEvent, GameState, Shadow, Transition, VectorQ } from './types';
 
 const trunc0 = (value: number) => (value < 0 ? Math.ceil(value) : Math.floor(value));
-const distance = (a: VectorQ, b: VectorQ) => Math.hypot(a.x - b.x, a.y - b.y);
+const distance = () => undefined;
 const pixels = (a: VectorQ, b: VectorQ) => distance(a, b) / Q;
 const unit = (from: VectorQ, to: VectorQ, id = 0): VectorQ => {
killedBy: world and reducer behavior re-evaluates reducer helper functions after module reset
statusReason: expected 952 to be 1400 // Object.is equality

[Killed] ArithmeticOperator
src/game/reducer.ts:8:44
 
 const trunc0 = (value: number) => (value < 0 ? Math.ceil(value) : Math.floor(value));
 const distance = (a: VectorQ, b: VectorQ) => Math.hypot(a.x - b.x, a.y - b.y);
-const pixels = (a: VectorQ, b: VectorQ) => distance(a, b) / Q;
+const pixels = (a: VectorQ, b: VectorQ) => distance(a, b) * Q;
 const unit = (from: VectorQ, to: VectorQ, id = 0): VectorQ => {
   const dx = to.x - from.x; const dy = to.y - from.y; const length = Math.floor(Math.sqrt(dx * dx + dy * dy));
killedBy: mutation-gap reducer contracts keeps shadows outside the lighthouse radial boundary
statusReason: expected { x: 89683832, y: 52428800 } to deeply equal { x: 89718784, y: 52428800 }

[Killed] ArrowFunction
src/game/reducer.ts:8:16
 
 const trunc0 = (value: number) => (value < 0 ? Math.ceil(value) : Math.floor(value));
 const distance = (a: VectorQ, b: VectorQ) => Math.hypot(a.x - b.x, a.y - b.y);
-const pixels = (a: VectorQ, b: VectorQ) => distance(a, b) / Q;
+const pixels = () => undefined;
 const unit = (from: VectorQ, to: VectorQ, id = 0): VectorQ => {
   const dx = to.x - from.x; const dy = to.y - from.y; const length = Math.floor(Math.sqrt(dx * dx + dy * dy));
killedBy: world and reducer behavior re-evaluates reducer helper functions after module reset
statusReason: expected 952 to be 1400 // Object.is equality

[Killed] ArithmeticOperator
src/game/reducer.ts:10:91
 const distance = (a: VectorQ, b: VectorQ) => Math.hypot(a.x - b.x, a.y - b.y);
 const pixels = (a: VectorQ, b: VectorQ) => distance(a, b) / Q;
 const unit = (from: VectorQ, to: VectorQ, id = 0): VectorQ => {
-  const dx = to.x - from.x; const dy = to.y - from.y; const length = Math.floor(Math.sqrt(dx * dx + dy * dy));
+  const dx = to.x - from.x; const dy = to.y - from.y; const length = Math.floor(Math.sqrt(dx * dx - dy * dy));
   return { x: trunc0((dx * Q) / length), y: trunc0((dy * Q) / length) };
killedBy: mutation-gap reducer contracts moves shadows diagonally and increases pursuit speed after each five banked stars
statusReason: expected { x: 98404488, y: 72089600 } to deeply equal { x: 98232946, y: 72018546 }

[Killed] ArithmeticOperator
src/game/reducer.ts:10:40
 const distance = (a: VectorQ, b: VectorQ) => Math.hypot(a.x - b.x, a.y - b.y);
 const pixels = (a: VectorQ, b: VectorQ) => distance(a, b) / Q;
 const unit = (from: VectorQ, to: VectorQ, id = 0): VectorQ => {
-  const dx = to.x - from.x; const dy = to.y - from.y; const length = Math.floor(Math.sqrt(dx * dx + dy * dy));
+  const dx = to.x - from.x; const dy = to.y + from.y; const length = Math.floor(Math.sqrt(dx * dx + dy * dy));
   return { x: trunc0((dx * Q) / length), y: trunc0((dy * Q) / length) };
killedBy: mutation-gap reducer contracts moves shadows diagonally and increases pursuit speed after each five banked stars
statusReason: expected { x: 98288328, y: 72188858 } to deeply equal { x: 98232946, y: 72018546 }

[Killed] ArithmeticOperator
src/game/reducer.ts:12:52
 const unit = (from: VectorQ, to: VectorQ, id = 0): VectorQ => {
   const dx = to.x - from.x; const dy = to.y - from.y; const length = Math.floor(Math.sqrt(dx * dx + dy * dy));
-  return { x: trunc0((dx * Q) / length), y: trunc0((dy * Q) / length) };
+  return { x: trunc0((dx * Q) / length), y: trunc0(dy * Q * length) };
 };
 const displacement = (direction: VectorQ, speed: number): VectorQ => ({ x: trunc0((direction.x * speed) / 60), y: trunc0((direction.y * speed) / 60) });
killedBy: mutation-gap reducer contracts moves shadows diagonally and increases pursuit speed after each five banked stars
statusReason: expected { x: 98232946, …(1) } to deeply equal { x: 98232946, y: 72018546 }

[Killed] ArithmeticOperator
src/game/reducer.ts:12:53
 const unit = (from: VectorQ, to: VectorQ, id = 0): VectorQ => {
   const dx = to.x - from.x; const dy = to.y - from.y; const length = Math.floor(Math.sqrt(dx * dx + dy * dy));
-  return { x: trunc0((dx * Q) / length), y: trunc0((dy * Q) / length) };
+  return { x: trunc0((dx * Q) / length), y: trunc0((dy / Q) / length) };
 };
 const displacement = (direction: VectorQ, speed: number): VectorQ => ({ x: trunc0((direction.x * speed) / 60), y: trunc0((direction.y * speed) / 60) });
killedBy: mutation-gap reducer contracts moves shadows diagonally and increases pursuit speed after each five banked stars
statusReason: expected { x: 98232946, y: 72089600 } to deeply equal { x: 98232946, y: 72018546 }

[Killed] ArithmeticOperator
src/game/reducer.ts:14:84
   return { x: trunc0((dx * Q) / length), y: trunc0((dy * Q) / length) };
 };
-const displacement = (direction: VectorQ, speed: number): VectorQ => ({ x: trunc0((direction.x * speed) / 60), y: trunc0((direction.y * speed) / 60) });
+const displacement = (direction: VectorQ, speed: number): VectorQ => ({ x: trunc0((direction.x / speed) / 60), y: trunc0((direction.y * speed) / 60) });
 
 function valid(state: GameState, movementQ: VectorQ): void {
killedBy: world and reducer behavior uses every deterministic fallback direction for a coincident shadow
statusReason: expected { x: 117964811, y: 52428800 } to deeply equal { x: 118065288, y: 52428800 }

[Killed] ArithmeticOperator
src/game/reducer.ts:14:83
   return { x: trunc0((dx * Q) / length), y: trunc0((dy * Q) / length) };
 };
-const displacement = (direction: VectorQ, speed: number): VectorQ => ({ x: trunc0((direction.x * speed) / 60), y: trunc0((direction.y * speed) / 60) });
+const displacement = (direction: VectorQ, speed: number): VectorQ => ({ x: trunc0(direction.x * speed * 60), y: trunc0((direction.y * speed) / 60) });
 
 function valid(state: GameState, movementQ: VectorQ): void {
killedBy: world and reducer behavior uses every deterministic fallback direction for a coincident shadow
statusReason: expected { x: 479723520, y: 52428800 } to deeply equal { x: 118065288, y: 52428800 }

[Killed] BlockStatement
src/game/reducer.ts:16:60
 };
 const displacement = (direction: VectorQ, speed: number): VectorQ => ({ x: trunc0((direction.x * speed) / 60), y: trunc0((direction.y * speed) / 60) });
 
-function valid(state: GameState, movementQ: VectorQ): void {
-  if (!state.rngState || !Number.isSafeInteger(state.rngState)) throw new Error('invalid game state');
-  if (!Number.isSafeInteger(movementQ.x) || !Number.isSafeInteger(movementQ.y) || Math.floor(Math.sqrt(movementQ.x ** 2 + movementQ.y ** 2)) > Q) throw new Error('invalid movement');
-  if (!Number.isSafeInteger(state.lantern.energyUnits) || state.lantern.energyUnits < 0 || state.lantern.energyUnits > MAX_ENERGY_UNITS) throw new Error('invalid lantern');
-  for (const list of [state.obstacles, state.availableStars, state.shadows]) {
-    const ids = list.map((item) => item.id); if (new Set(ids).size !== ids.length) throw new Error('duplicate entity id');
-  }
-}
+function valid(state: GameState, movementQ: VectorQ): void {}
 
 function movePlayer(state: GameState, movementQ: VectorQ): VectorQ {
killedBy: fixed-step reducer contract rejects invalid movement vectors and duplicate entity IDs at the domain boundary
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/game/reducer.ts:17:7
 const displacement = (direction: VectorQ, speed: number): VectorQ => ({ x: trunc0((direction.x * speed) / 60), y: trunc0((direction.y * speed) / 60) });
 
 function valid(state: GameState, movementQ: VectorQ): void {
-  if (!state.rngState || !Number.isSafeInteger(state.rngState)) throw new Error('invalid game state');
+  if (false) throw new Error('invalid game state');
   if (!Number.isSafeInteger(movementQ.x) || !Number.isSafeInteger(movementQ.y) || Math.floor(Math.sqrt(movementQ.x ** 2 + movementQ.y ** 2)) > Q) throw new Error('invalid movement');
   if (!Number.isSafeInteger(state.lantern.energyUnits) || state.lantern.energyUnits < 0 || state.lantern.energyUnits > MAX_ENERGY_UNITS) throw new Error('invalid lantern');
killedBy: mutation-gap reducer contracts rejects each malformed movement/state scalar and duplicate entity list
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/game/reducer.ts:17:7
 const displacement = (direction: VectorQ, speed: number): VectorQ => ({ x: trunc0((direction.x * speed) / 60), y: trunc0((direction.y * speed) / 60) });
 
 function valid(state: GameState, movementQ: VectorQ): void {
-  if (!state.rngState || !Number.isSafeInteger(state.rngState)) throw new Error('invalid game state');
+  if (true) throw new Error('invalid game state');
   if (!Number.isSafeInteger(movementQ.x) || !Number.isSafeInteger(movementQ.y) || Math.floor(Math.sqrt(movementQ.x ** 2 + movementQ.y ** 2)) > Q) throw new Error('invalid movement');
   if (!Number.isSafeInteger(state.lantern.energyUnits) || state.lantern.energyUnits < 0 || state.lantern.energyUnits > MAX_ENERGY_UNITS) throw new Error('invalid lantern');
killedBy: mutation-gap reducer contracts rejects each malformed movement/state scalar and duplicate entity list
statusReason: expected [Function] to throw error including 'invalid movement' but got 'invalid game state'

[Killed] LogicalOperator
src/game/reducer.ts:18:7
 
 function valid(state: GameState, movementQ: VectorQ): void {
   if (!state.rngState || !Number.isSafeInteger(state.rngState)) throw new Error('invalid game state');
-  if (!Number.isSafeInteger(movementQ.x) || !Number.isSafeInteger(movementQ.y) || Math.floor(Math.sqrt(movementQ.x ** 2 + movementQ.y ** 2)) > Q) throw new Error('invalid movement');
+  if ((!Number.isSafeInteger(movementQ.x) || !Number.isSafeInteger(movementQ.y)) && Math.floor(Math.sqrt(movementQ.x ** 2 + movementQ.y ** 2)) > Q) throw new Error('invalid movement');
   if (!Number.isSafeInteger(state.lantern.energyUnits) || state.lantern.energyUnits < 0 || state.lantern.energyUnits > MAX_ENERGY_UNITS) throw new Error('invalid lantern');
   for (const list of [state.obstacles, state.availableStars, state.shadows]) {
killedBy: mutation-gap reducer contracts rejects each malformed movement/state scalar and duplicate entity list
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/game/reducer.ts:18:104
 
 function valid(state: GameState, movementQ: VectorQ): void {
   if (!state.rngState || !Number.isSafeInteger(state.rngState)) throw new Error('invalid game state');
-  if (!Number.isSafeInteger(movementQ.x) || !Number.isSafeInteger(movementQ.y) || Math.floor(Math.sqrt(movementQ.x ** 2 + movementQ.y ** 2)) > Q) throw new Error('invalid movement');
+  if (!Number.isSafeInteger(movementQ.x) || !Number.isSafeInteger(movementQ.y) || Math.floor(Math.sqrt(movementQ.x ** 2 - movementQ.y ** 2)) > Q) throw new Error('invalid movement');
   if (!Number.isSafeInteger(state.lantern.energyUnits) || state.lantern.energyUnits < 0 || state.lantern.energyUnits > MAX_ENERGY_UNITS) throw new Error('invalid lantern');
   for (const list of [state.obstacles, state.availableStars, state.shadows]) {
killedBy: mutation-gap reducer contracts rejects each malformed movement/state scalar and duplicate entity list
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/game/reducer.ts:19:59
 function valid(state: GameState, movementQ: VectorQ): void {
   if (!state.rngState || !Number.isSafeInteger(state.rngState)) throw new Error('invalid game state');
   if (!Number.isSafeInteger(movementQ.x) || !Number.isSafeInteger(movementQ.y) || Math.floor(Math.sqrt(movementQ.x ** 2 + movementQ.y ** 2)) > Q) throw new Error('invalid movement');
-  if (!Number.isSafeInteger(state.lantern.energyUnits) || state.lantern.energyUnits < 0 || state.lantern.energyUnits > MAX_ENERGY_UNITS) throw new Error('invalid lantern');
+  if (!Number.isSafeInteger(state.lantern.energyUnits) || state.lantern.energyUnits >= 0 || state.lantern.energyUnits > MAX_ENERGY_UNITS) throw new Error('invalid lantern');
   for (const list of [state.obstacles, state.availableStars, state.shadows]) {
     const ids = list.map((item) => item.id); if (new Set(ids).size !== ids.length) throw new Error('duplicate entity id');
killedBy: mutation-gap reducer contracts rejects each malformed movement/state scalar and duplicate entity list
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/game/reducer.ts:19:7
 function valid(state: GameState, movementQ: VectorQ): void {
   if (!state.rngState || !Number.isSafeInteger(state.rngState)) throw new Error('invalid game state');
   if (!Number.isSafeInteger(movementQ.x) || !Number.isSafeInteger(movementQ.y) || Math.floor(Math.sqrt(movementQ.x ** 2 + movementQ.y ** 2)) > Q) throw new Error('invalid movement');
-  if (!Number.isSafeInteger(state.lantern.energyUnits) || state.lantern.energyUnits < 0 || state.lantern.energyUnits > MAX_ENERGY_UNITS) throw new Error('invalid lantern');
+  if (!Number.isSafeInteger(state.lantern.energyUnits) && state.lantern.energyUnits < 0 || state.lantern.energyUnits > MAX_ENERGY_UNITS) throw new Error('invalid lantern');
   for (const list of [state.obstacles, state.availableStars, state.shadows]) {
     const ids = list.map((item) => item.id); if (new Set(ids).size !== ids.length) throw new Error('duplicate entity id');
killedBy: mutation-gap reducer contracts rejects each malformed movement/state scalar and duplicate entity list
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/game/reducer.ts:20:78
   if (!state.rngState || !Number.isSafeInteger(state.rngState)) throw new Error('invalid game state');
   if (!Number.isSafeInteger(movementQ.x) || !Number.isSafeInteger(movementQ.y) || Math.floor(Math.sqrt(movementQ.x ** 2 + movementQ.y ** 2)) > Q) throw new Error('invalid movement');
   if (!Number.isSafeInteger(state.lantern.energyUnits) || state.lantern.energyUnits < 0 || state.lantern.energyUnits > MAX_ENERGY_UNITS) throw new Error('invalid lantern');
-  for (const list of [state.obstacles, state.availableStars, state.shadows]) {
-    const ids = list.map((item) => item.id); if (new Set(ids).size !== ids.length) throw new Error('duplicate entity id');
-  }
+  for (const list of [state.obstacles, state.availableStars, state.shadows]) {}
 }
 
killedBy: mutation-gap reducer contracts rejects each malformed movement/state scalar and duplicate entity list
statusReason: expected [Function] to throw an error

[Killed] ArrowFunction
src/game/reducer.ts:21:26
   if (!Number.isSafeInteger(movementQ.x) || !Number.isSafeInteger(movementQ.y) || Math.floor(Math.sqrt(movementQ.x ** 2 + movementQ.y ** 2)) > Q) throw new Error('invalid movement');
   if (!Number.isSafeInteger(state.lantern.energyUnits) || state.lantern.energyUnits < 0 || state.lantern.energyUnits > MAX_ENERGY_UNITS) throw new Error('invalid lantern');
   for (const list of [state.obstacles, state.availableStars, state.shadows]) {
-    const ids = list.map((item) => item.id); if (new Set(ids).size !== ids.length) throw new Error('duplicate entity id');
+    const ids = list.map(() => undefined); if (new Set(ids).size !== ids.length) throw new Error('duplicate entity id');
   }
 }
killedBy: mutation-gap reducer contracts clamps player motion independently at all four world borders
statusReason: duplicate entity id

[Killed] ConditionalExpression
src/game/reducer.ts:21:50
   if (!Number.isSafeInteger(movementQ.x) || !Number.isSafeInteger(movementQ.y) || Math.floor(Math.sqrt(movementQ.x ** 2 + movementQ.y ** 2)) > Q) throw new Error('invalid movement');
   if (!Number.isSafeInteger(state.lantern.energyUnits) || state.lantern.energyUnits < 0 || state.lantern.energyUnits > MAX_ENERGY_UNITS) throw new Error('invalid lantern');
   for (const list of [state.obstacles, state.availableStars, state.shadows]) {
-    const ids = list.map((item) => item.id); if (new Set(ids).size !== ids.length) throw new Error('duplicate entity id');
+    const ids = list.map((item) => item.id); if (false) throw new Error('duplicate entity id');
   }
 }
killedBy: mutation-gap reducer contracts rejects each malformed movement/state scalar and duplicate entity list
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/game/reducer.ts:25:68
   }
 }
 
-function movePlayer(state: GameState, movementQ: VectorQ): VectorQ {
-  const move = displacement(movementQ, 230);
-  const candidate = { x: state.player.centerQ.x + move.x, y: state.player.centerQ.y + move.y };
-  return { x: Math.max(PLAYER_RADIUS * Q, Math.min((2400 - PLAYER_RADIUS) * Q, candidate.x)), y: Math.max(PLAYER_RADIUS * Q, Math.min((1600 - PLAYER_RADIUS) * Q, candidate.y)) };
-}
+function movePlayer(state: GameState, movementQ: VectorQ): VectorQ {}
 
 function moveShadow(shadow: Shadow, player: VectorQ, banked: number, lit: boolean): Shadow {
killedBy: mutation-gap reducer contracts clamps player motion independently at all four world borders
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] ArithmeticOperator
src/game/reducer.ts:27:26
 
 function movePlayer(state: GameState, movementQ: VectorQ): VectorQ {
   const move = displacement(movementQ, 230);
-  const candidate = { x: state.player.centerQ.x + move.x, y: state.player.centerQ.y + move.y };
+  const candidate = { x: state.player.centerQ.x - move.x, y: state.player.centerQ.y + move.y };
   return { x: Math.max(PLAYER_RADIUS * Q, Math.min((2400 - PLAYER_RADIUS) * Q, candidate.x)), y: Math.max(PLAYER_RADIUS * Q, Math.min((1600 - PLAYER_RADIUS) * Q, candidate.y)) };
 }
killedBy: mutation-gap reducer contracts clamps player motion independently at all four world borders
statusReason: expected 155789995 to be 156106752 // Object.is equality

[Killed] ArithmeticOperator
src/game/reducer.ts:27:62
 
 function movePlayer(state: GameState, movementQ: VectorQ): VectorQ {
   const move = displacement(movementQ, 230);
-  const candidate = { x: state.player.centerQ.x + move.x, y: state.player.centerQ.y + move.y };
+  const candidate = { x: state.player.centerQ.x + move.x, y: state.player.centerQ.y - move.y };
   return { x: Math.max(PLAYER_RADIUS * Q, Math.min((2400 - PLAYER_RADIUS) * Q, candidate.x)), y: Math.max(PLAYER_RADIUS * Q, Math.min((1600 - PLAYER_RADIUS) * Q, candidate.y)) };
 }
killedBy: mutation-gap reducer contracts clamps player motion independently at all four world borders
statusReason: expected 103361195 to be 103677952 // Object.is equality

[Killed] ArithmeticOperator
src/game/reducer.ts:28:52
 function movePlayer(state: GameState, movementQ: VectorQ): VectorQ {
   const move = displacement(movementQ, 230);
   const candidate = { x: state.player.centerQ.x + move.x, y: state.player.centerQ.y + move.y };
-  return { x: Math.max(PLAYER_RADIUS * Q, Math.min((2400 - PLAYER_RADIUS) * Q, candidate.x)), y: Math.max(PLAYER_RADIUS * Q, Math.min((1600 - PLAYER_RADIUS) * Q, candidate.y)) };
+  return { x: Math.max(PLAYER_RADIUS * Q, Math.min((2400 - PLAYER_RADIUS) / Q, candidate.x)), y: Math.max(PLAYER_RADIUS * Q, Math.min((1600 - PLAYER_RADIUS) * Q, candidate.y)) };
 }
 
killedBy: mutation-gap reducer contracts clamps player motion independently at all four world borders
statusReason: expected 1179648 to be 156106752 // Object.is equality

[Killed] ArithmeticOperator
src/game/reducer.ts:28:136
 function movePlayer(state: GameState, movementQ: VectorQ): VectorQ {
   const move = displacement(movementQ, 230);
   const candidate = { x: state.player.centerQ.x + move.x, y: state.player.centerQ.y + move.y };
-  return { x: Math.max(PLAYER_RADIUS * Q, Math.min((2400 - PLAYER_RADIUS) * Q, candidate.x)), y: Math.max(PLAYER_RADIUS * Q, Math.min((1600 - PLAYER_RADIUS) * Q, candidate.y)) };
+  return { x: Math.max(PLAYER_RADIUS * Q, Math.min((2400 - PLAYER_RADIUS) * Q, candidate.x)), y: Math.max(PLAYER_RADIUS * Q, Math.min((1600 + PLAYER_RADIUS) * Q, candidate.y)) };
 }
 
killedBy: mutation-gap reducer contracts clamps player motion independently at all four world borders
statusReason: expected 103863637 to be 103677952 // Object.is equality

[Killed] BlockStatement
src/game/reducer.ts:31:92
   return { x: Math.max(PLAYER_RADIUS * Q, Math.min((2400 - PLAYER_RADIUS) * Q, candidate.x)), y: Math.max(PLAYER_RADIUS * Q, Math.min((1600 - PLAYER_RADIUS) * Q, candidate.y)) };
 }
 
-function moveShadow(shadow: Shadow, player: VectorQ, banked: number, lit: boolean): Shadow {
-  const toward = unit(shadow.centerQ, player, shadow.id); const speed = 92 + 4 * Math.floor(banked / 5); const pursuit = displacement(toward, speed);
-  let centerQ = { x: shadow.centerQ.x + pursuit.x, y: shadow.centerQ.y + pursuit.y };
-  if (pixels(centerQ, LIGHTHOUSE) < 169) {
-    const radial = unit(LIGHTHOUSE, centerQ, shadow.id); centerQ = { x: LIGHTHOUSE.x + radial.x * 169, y: LIGHTHOUSE.y + radial.y * 169 };
-  }
-  let graceTicks = shadow.graceTicks;
-  if (lit && pixels(centerQ, player) <= 155) {
-    const away = unit(player, centerQ, shadow.id); const repel = displacement(away, 300); centerQ = { x: centerQ.x + repel.x, y: centerQ.y + repel.y }; graceTicks = 21;
-  }
-  return { ...shadow, centerQ, graceTicks };
-}
+function moveShadow(shadow: Shadow, player: VectorQ, banked: number, lit: boolean): Shadow {}
 
 function spawnShadow(state: GameState, tick: number): GameState {
killedBy: mutation-gap reducer contracts moves shadows diagonally and increases pursuit speed after each five banked stars
statusReason: Cannot read properties of undefined (reading 'graceTicks')

[Killed] ArithmeticOperator
src/game/reducer.ts:32:73
 }
 
 function moveShadow(shadow: Shadow, player: VectorQ, banked: number, lit: boolean): Shadow {
-  const toward = unit(shadow.centerQ, player, shadow.id); const speed = 92 + 4 * Math.floor(banked / 5); const pursuit = displacement(toward, speed);
+  const toward = unit(shadow.centerQ, player, shadow.id); const speed = 92 - 4 * Math.floor(banked / 5); const pursuit = displacement(toward, speed);
   let centerQ = { x: shadow.centerQ.x + pursuit.x, y: shadow.centerQ.y + pursuit.y };
   if (pixels(centerQ, LIGHTHOUSE) < 169) {
killedBy: mutation-gap reducer contracts moves shadows diagonally and increases pursuit speed after each five banked stars
statusReason: expected 117868681 to be 117859943 // Object.is equality

[Killed] ArithmeticOperator
src/game/reducer.ts:32:78
 }
 
 function moveShadow(shadow: Shadow, player: VectorQ, banked: number, lit: boolean): Shadow {
-  const toward = unit(shadow.centerQ, player, shadow.id); const speed = 92 + 4 * Math.floor(banked / 5); const pursuit = displacement(toward, speed);
+  const toward = unit(shadow.centerQ, player, shadow.id); const speed = 92 + 4 / Math.floor(banked / 5); const pursuit = displacement(toward, speed);
   let centerQ = { x: shadow.centerQ.x + pursuit.x, y: shadow.centerQ.y + pursuit.y };
   if (pixels(centerQ, LIGHTHOUSE) < 169) {
killedBy: mutation-gap reducer contracts moves shadows diagonally and increases pursuit speed after each five banked stars
statusReason: expected { x: -Infinity, y: -Infinity } to deeply equal { x: 98232946, y: 72018546 }

[Killed] ArithmeticOperator
src/game/reducer.ts:33:55
 
 function moveShadow(shadow: Shadow, player: VectorQ, banked: number, lit: boolean): Shadow {
   const toward = unit(shadow.centerQ, player, shadow.id); const speed = 92 + 4 * Math.floor(banked / 5); const pursuit = displacement(toward, speed);
-  let centerQ = { x: shadow.centerQ.x + pursuit.x, y: shadow.centerQ.y + pursuit.y };
+  let centerQ = { x: shadow.centerQ.x + pursuit.x, y: shadow.centerQ.y - pursuit.y };
   if (pixels(centerQ, LIGHTHOUSE) < 169) {
     const radial = unit(LIGHTHOUSE, centerQ, shadow.id); centerQ = { x: LIGHTHOUSE.x + radial.x * 169, y: LIGHTHOUSE.y + radial.y * 169 };
killedBy: mutation-gap reducer contracts moves shadows diagonally and increases pursuit speed after each five banked stars
statusReason: expected { x: 98232946, y: 72160654 } to deeply equal { x: 98232946, y: 72018546 }

[Killed] ArithmeticOperator
src/game/reducer.ts:33:22
 
 function moveShadow(shadow: Shadow, player: VectorQ, banked: number, lit: boolean): Shadow {
   const toward = unit(shadow.centerQ, player, shadow.id); const speed = 92 + 4 * Math.floor(banked / 5); const pursuit = displacement(toward, speed);
-  let centerQ = { x: shadow.centerQ.x + pursuit.x, y: shadow.centerQ.y + pursuit.y };
+  let centerQ = { x: shadow.centerQ.x - pursuit.x, y: shadow.centerQ.y + pursuit.y };
   if (pixels(centerQ, LIGHTHOUSE) < 169) {
     const radial = unit(LIGHTHOUSE, centerQ, shadow.id); centerQ = { x: LIGHTHOUSE.x + radial.x * 169, y: LIGHTHOUSE.y + radial.y * 169 };
killedBy: mutation-gap reducer contracts moves shadows diagonally and increases pursuit speed after each five banked stars
statusReason: expected { x: 98375054, y: 72018546 } to deeply equal { x: 98232946, y: 72018546 }

[Killed] ConditionalExpression
src/game/reducer.ts:34:7
 function moveShadow(shadow: Shadow, player: VectorQ, banked: number, lit: boolean): Shadow {
   const toward = unit(shadow.centerQ, player, shadow.id); const speed = 92 + 4 * Math.floor(banked / 5); const pursuit = displacement(toward, speed);
   let centerQ = { x: shadow.centerQ.x + pursuit.x, y: shadow.centerQ.y + pursuit.y };
-  if (pixels(centerQ, LIGHTHOUSE) < 169) {
+  if (false) {
     const radial = unit(LIGHTHOUSE, centerQ, shadow.id); centerQ = { x: LIGHTHOUSE.x + radial.x * 169, y: LIGHTHOUSE.y + radial.y * 169 };
   }
killedBy: mutation-gap reducer contracts keeps shadows outside the lighthouse radial boundary
statusReason: expected { x: 89683832, y: 52428800 } to deeply equal { x: 89718784, y: 52428800 }

[Killed] ConditionalExpression
src/game/reducer.ts:34:7
 function moveShadow(shadow: Shadow, player: VectorQ, banked: number, lit: boolean): Shadow {
   const toward = unit(shadow.centerQ, player, shadow.id); const speed = 92 + 4 * Math.floor(banked / 5); const pursuit = displacement(toward, speed);
   let centerQ = { x: shadow.centerQ.x + pursuit.x, y: shadow.centerQ.y + pursuit.y };
-  if (pixels(centerQ, LIGHTHOUSE) < 169) {
+  if (true) {
     const radial = unit(LIGHTHOUSE, centerQ, shadow.id); centerQ = { x: LIGHTHOUSE.x + radial.x * 169, y: LIGHTHOUSE.y + radial.y * 169 };
   }
killedBy: mutation-gap reducer contracts moves shadows diagonally and increases pursuit speed after each five banked stars
statusReason: expected { x: 86474660, y: 60260260 } to deeply equal { x: 98232946, y: 72018546 }

[Killed] ArithmeticOperator
src/game/reducer.ts:35:107
   const toward = unit(shadow.centerQ, player, shadow.id); const speed = 92 + 4 * Math.floor(banked / 5); const pursuit = displacement(toward, speed);
   let centerQ = { x: shadow.centerQ.x + pursuit.x, y: shadow.centerQ.y + pursuit.y };
   if (pixels(centerQ, LIGHTHOUSE) < 169) {
-    const radial = unit(LIGHTHOUSE, centerQ, shadow.id); centerQ = { x: LIGHTHOUSE.x + radial.x * 169, y: LIGHTHOUSE.y + radial.y * 169 };
+    const radial = unit(LIGHTHOUSE, centerQ, shadow.id); centerQ = { x: LIGHTHOUSE.x + radial.x * 169, y: LIGHTHOUSE.y - radial.y * 169 };
   }
   let graceTicks = shadow.graceTicks;
killedBy: mutation-gap reducer boundary contracts uses diagonal radial correction output rather than only its x coordinate
statusReason: expected { x: 86474660, y: 44597340 } to deeply equal { x: 86474660, y: 60260260 }
