[Killed] ArithmeticOperator
src/game/reducer.ts:35:88
   const toward = unit(shadow.centerQ, player, shadow.id); const speed = 92 + 4 * Math.floor(banked / 5); const pursuit = displacement(toward, speed);
   let centerQ = { x: shadow.centerQ.x + pursuit.x, y: shadow.centerQ.y + pursuit.y };
   if (pixels(centerQ, LIGHTHOUSE) < 169) {
-    const radial = unit(LIGHTHOUSE, centerQ, shadow.id); centerQ = { x: LIGHTHOUSE.x + radial.x * 169, y: LIGHTHOUSE.y + radial.y * 169 };
+    const radial = unit(LIGHTHOUSE, centerQ, shadow.id); centerQ = { x: LIGHTHOUSE.x + radial.x / 169, y: LIGHTHOUSE.y + radial.y * 169 };
   }
   let graceTicks = shadow.graceTicks;
killedBy: mutation-gap reducer contracts keeps shadows outside the lighthouse radial boundary
statusReason: expected { x: 78971932.78698225, y: 52428800 } to deeply equal { x: 89718784, y: 52428800 }

[Killed] ConditionalExpression
src/game/reducer.ts:38:7
     const radial = unit(LIGHTHOUSE, centerQ, shadow.id); centerQ = { x: LIGHTHOUSE.x + radial.x * 169, y: LIGHTHOUSE.y + radial.y * 169 };
   }
   let graceTicks = shadow.graceTicks;
-  if (lit && pixels(centerQ, player) <= 155) {
+  if (true) {
     const away = unit(player, centerQ, shadow.id); const repel = displacement(away, 300); centerQ = { x: centerQ.x + repel.x, y: centerQ.y + repel.y }; graceTicks = 21;
   }
killedBy: mutation-gap reducer contracts moves shadows diagonally and increases pursuit speed after each five banked stars
statusReason: expected { x: 98464646, y: 72250246 } to deeply equal { x: 98232946, y: 72018546 }

[Killed] ConditionalExpression
src/game/reducer.ts:38:14
     const radial = unit(LIGHTHOUSE, centerQ, shadow.id); centerQ = { x: LIGHTHOUSE.x + radial.x * 169, y: LIGHTHOUSE.y + radial.y * 169 };
   }
   let graceTicks = shadow.graceTicks;
-  if (lit && pixels(centerQ, player) <= 155) {
+  if (lit && true) {
     const away = unit(player, centerQ, shadow.id); const repel = displacement(away, 300); centerQ = { x: centerQ.x + repel.x, y: centerQ.y + repel.y }; graceTicks = 21;
   }
killedBy: mutation-gap reducer contracts moves shadows diagonally and increases pursuit speed after each five banked stars
statusReason: expected { x: 98464646, y: 72250246 } to deeply equal { x: 98232946, y: 72018546 }

[Killed] ArithmeticOperator
src/game/reducer.ts:39:106
   }
   let graceTicks = shadow.graceTicks;
   if (lit && pixels(centerQ, player) <= 155) {
-    const away = unit(player, centerQ, shadow.id); const repel = displacement(away, 300); centerQ = { x: centerQ.x + repel.x, y: centerQ.y + repel.y }; graceTicks = 21;
+    const away = unit(player, centerQ, shadow.id); const repel = displacement(away, 300); centerQ = { x: centerQ.x - repel.x, y: centerQ.y + repel.y }; graceTicks = 21;
   }
   return { ...shadow, centerQ, graceTicks };
killedBy: fixed-step reducer contract applies a lit-lantern repel once after pursuit and resets grace
statusReason: expected 127694712 to be greater than 128122880

[Killed] ArithmeticOperator
src/game/reducer.ts:39:130
   }
   let graceTicks = shadow.graceTicks;
   if (lit && pixels(centerQ, player) <= 155) {
-    const away = unit(player, centerQ, shadow.id); const repel = displacement(away, 300); centerQ = { x: centerQ.x + repel.x, y: centerQ.y + repel.y }; graceTicks = 21;
+    const away = unit(player, centerQ, shadow.id); const repel = displacement(away, 300); centerQ = { x: centerQ.x + repel.x, y: centerQ.y - repel.y }; graceTicks = 21;
   }
   return { ...shadow, centerQ, graceTicks };
killedBy: mutation-gap reducer contracts applies repel at the inclusive radius and records both axes
statusReason: expected 59369958 to be greater than 59672712

[Killed] BlockStatement
src/game/reducer.ts:44:65
   return { ...shadow, centerQ, graceTicks };
 }
 
-function spawnShadow(state: GameState, tick: number): GameState {
-  if (tick < 720 || (tick - 720) % 1800 !== 0 || state.shadows.length >= 2 + Math.floor(state.bankedStars / 5)) return state;
-  const player = state.player.centerQ; const centerQ = { x: Math.min(2381 * Q, player.x + 600 * Q), y: player.y };
-  return { ...state, shadows: [...state.shadows, { id: state.nextShadowId, centerQ, graceTicks: 21 }], nextShadowId: state.nextShadowId + 1 };
-}
+function spawnShadow(state: GameState, tick: number): GameState {}
 
 export function advance(state: Readonly<GameState>, action: { kind: 'tick'; movementQ: VectorQ }): Transition {
killedBy: world and reducer behavior uses every deterministic fallback direction for a coincident shadow
statusReason: Cannot read properties of undefined (reading 'shadows')

[Killed] LogicalOperator
src/game/reducer.ts:45:7
 }
 
 function spawnShadow(state: GameState, tick: number): GameState {
-  if (tick < 720 || (tick - 720) % 1800 !== 0 || state.shadows.length >= 2 + Math.floor(state.bankedStars / 5)) return state;
+  if (tick < 720 && (tick - 720) % 1800 !== 0 || state.shadows.length >= 2 + Math.floor(state.bankedStars / 5)) return state;
   const player = state.player.centerQ; const centerQ = { x: Math.min(2381 * Q, player.x + 600 * Q), y: player.y };
   return { ...state, shadows: [...state.shadows, { id: state.nextShadowId, centerQ, graceTicks: 21 }], nextShadowId: state.nextShadowId + 1 };
killedBy: world and reducer behavior spawns only on cadence and only below the exact capacity
statusReason: expected [ { id: +0, centerQ: { …(2) }, …(1) } ] to deeply equal []

[Killed] EqualityOperator
src/game/reducer.ts:45:7
 }
 
 function spawnShadow(state: GameState, tick: number): GameState {
-  if (tick < 720 || (tick - 720) % 1800 !== 0 || state.shadows.length >= 2 + Math.floor(state.bankedStars / 5)) return state;
+  if (tick <= 720 || (tick - 720) % 1800 !== 0 || state.shadows.length >= 2 + Math.floor(state.bankedStars / 5)) return state;
   const player = state.player.centerQ; const centerQ = { x: Math.min(2381 * Q, player.x + 600 * Q), y: player.y };
   return { ...state, shadows: [...state.shadows, { id: state.nextShadowId, centerQ, graceTicks: 21 }], nextShadowId: state.nextShadowId + 1 };
killedBy: mutation-gap reducer contracts decrements ordinary shadow grace and never decrements newly spawned grace
statusReason: Cannot read properties of undefined (reading 'graceTicks')

[Killed] MethodExpression
src/game/reducer.ts:46:61
 
 function spawnShadow(state: GameState, tick: number): GameState {
   if (tick < 720 || (tick - 720) % 1800 !== 0 || state.shadows.length >= 2 + Math.floor(state.bankedStars / 5)) return state;
-  const player = state.player.centerQ; const centerQ = { x: Math.min(2381 * Q, player.x + 600 * Q), y: player.y };
+  const player = state.player.centerQ; const centerQ = { x: Math.max(2381 * Q, player.x + 600 * Q), y: player.y };
   return { ...state, shadows: [...state.shadows, { id: state.nextShadowId, centerQ, graceTicks: 21 }], nextShadowId: state.nextShadowId + 1 };
 }
killedBy: fixed-step reducer contract creates no shadow before tick 720 and creates at most the eligible target on cadence
statusReason: expected 1179.4666748046875 to be less than or equal to 760

[Killed] ArithmeticOperator
src/game/reducer.ts:46:80
 
 function spawnShadow(state: GameState, tick: number): GameState {
   if (tick < 720 || (tick - 720) % 1800 !== 0 || state.shadows.length >= 2 + Math.floor(state.bankedStars / 5)) return state;
-  const player = state.player.centerQ; const centerQ = { x: Math.min(2381 * Q, player.x + 600 * Q), y: player.y };
+  const player = state.player.centerQ; const centerQ = { x: Math.min(2381 * Q, player.x - 600 * Q), y: player.y };
   return { ...state, shadows: [...state.shadows, { id: state.nextShadowId, centerQ, graceTicks: 21 }], nextShadowId: state.nextShadowId + 1 };
 }
killedBy: mutation-gap reducer boundary contracts uses banked-star shadow capacity and preserves the spawn position and ID
statusReason: expected { id: 40, …(2) } to match object { id: 40, centerQ: { …(2) } }
(1 matching property omitted from actual)

[Killed] ArithmeticOperator
src/game/reducer.ts:47:118
 function spawnShadow(state: GameState, tick: number): GameState {
   if (tick < 720 || (tick - 720) % 1800 !== 0 || state.shadows.length >= 2 + Math.floor(state.bankedStars / 5)) return state;
   const player = state.player.centerQ; const centerQ = { x: Math.min(2381 * Q, player.x + 600 * Q), y: player.y };
-  return { ...state, shadows: [...state.shadows, { id: state.nextShadowId, centerQ, graceTicks: 21 }], nextShadowId: state.nextShadowId + 1 };
+  return { ...state, shadows: [...state.shadows, { id: state.nextShadowId, centerQ, graceTicks: 21 }], nextShadowId: state.nextShadowId - 1 };
 }
 
killedBy: mutation-gap reducer boundary contracts uses banked-star shadow capacity and preserves the spawn position and ID
statusReason: expected 39 to be 41 // Object.is equality

[Killed] ArrayDeclaration
src/game/reducer.ts:47:31
 function spawnShadow(state: GameState, tick: number): GameState {
   if (tick < 720 || (tick - 720) % 1800 !== 0 || state.shadows.length >= 2 + Math.floor(state.bankedStars / 5)) return state;
   const player = state.player.centerQ; const centerQ = { x: Math.min(2381 * Q, player.x + 600 * Q), y: player.y };
-  return { ...state, shadows: [...state.shadows, { id: state.nextShadowId, centerQ, graceTicks: 21 }], nextShadowId: state.nextShadowId + 1 };
+  return { ...state, shadows: [], nextShadowId: state.nextShadowId + 1 };
 }
 
killedBy: mutation-gap reducer contracts decrements ordinary shadow grace and never decrements newly spawned grace
statusReason: Cannot read properties of undefined (reading 'graceTicks')

[Killed] ConditionalExpression
src/game/reducer.ts:52:7
 
 export function advance(state: Readonly<GameState>, action: { kind: 'tick'; movementQ: VectorQ }): Transition {
   valid(state, action.movementQ);
-  if (state.phase !== 'playing') return { state, events: [] };
+  if (true) return { state, events: [] };
   const events: GameEvent[] = []; const tick = state.tick + 1; const playerCenterQ = movePlayer(state, action.movementQ);
   const safe = pixels(playerCenterQ, LIGHTHOUSE) <= SAFE_RADIUS;
killedBy: mutation-gap reducer contracts clamps player motion independently at all four world borders
statusReason: expected 156041216 to be 156106752 // Object.is equality

[Killed] ConditionalExpression
src/game/reducer.ts:52:7
 
 export function advance(state: Readonly<GameState>, action: { kind: 'tick'; movementQ: VectorQ }): Transition {
   valid(state, action.movementQ);
-  if (state.phase !== 'playing') return { state, events: [] };
+  if (false) return { state, events: [] };
   const events: GameEvent[] = []; const tick = state.tick + 1; const playerCenterQ = movePlayer(state, action.movementQ);
   const safe = pixels(playerCenterQ, LIGHTHOUSE) <= SAFE_RADIUS;
killedBy: mutation-gap reducer terminal and cadence contracts returns terminal states unchanged without events
statusReason: expected { phase: 'won', tick: 43, …(11) } to be { phase: 'won', tick: 42, …(11) } // Object.is equality

[Killed] ArithmeticOperator
src/game/reducer.ts:53:48
 export function advance(state: Readonly<GameState>, action: { kind: 'tick'; movementQ: VectorQ }): Transition {
   valid(state, action.movementQ);
   if (state.phase !== 'playing') return { state, events: [] };
-  const events: GameEvent[] = []; const tick = state.tick + 1; const playerCenterQ = movePlayer(state, action.movementQ);
+  const events: GameEvent[] = []; const tick = state.tick - 1; const playerCenterQ = movePlayer(state, action.movementQ);
   const safe = pixels(playerCenterQ, LIGHTHOUSE) <= SAFE_RADIUS;
   let next: GameState = { ...state, tick, player: { centerQ: playerCenterQ }, lantern: { energyUnits: Math.max(0, Math.min(MAX_ENERGY_UNITS, state.lantern.energyUnits + (safe ? 400 : -48))) } };
killedBy: mutation-gap reducer contracts decrements ordinary shadow grace and never decrements newly spawned grace
statusReason: Cannot read properties of undefined (reading 'graceTicks')

[Killed] ConditionalExpression
src/game/reducer.ts:54:16
   valid(state, action.movementQ);
   if (state.phase !== 'playing') return { state, events: [] };
   const events: GameEvent[] = []; const tick = state.tick + 1; const playerCenterQ = movePlayer(state, action.movementQ);
-  const safe = pixels(playerCenterQ, LIGHTHOUSE) <= SAFE_RADIUS;
+  const safe = false;
   let next: GameState = { ...state, tick, player: { centerQ: playerCenterQ }, lantern: { energyUnits: Math.max(0, Math.min(MAX_ENERGY_UNITS, state.lantern.energyUnits + (safe ? 400 : -48))) } };
   if (tick % 720 === 0 && next.availableStars.length + next.carriedStars.length < 28 && !next.pendingStarRespawn) next = { ...next, pendingStarRespawn: { dueTick: tick } };
killedBy: mutation-gap reducer boundary contracts distinguishes safe-zone and collision boundaries and reports gameplay events
statusReason: expected 952 to be 1400 // Object.is equality

[Killed] EqualityOperator
src/game/reducer.ts:54:16
   valid(state, action.movementQ);
   if (state.phase !== 'playing') return { state, events: [] };
   const events: GameEvent[] = []; const tick = state.tick + 1; const playerCenterQ = movePlayer(state, action.movementQ);
-  const safe = pixels(playerCenterQ, LIGHTHOUSE) <= SAFE_RADIUS;
+  const safe = pixels(playerCenterQ, LIGHTHOUSE) < SAFE_RADIUS;
   let next: GameState = { ...state, tick, player: { centerQ: playerCenterQ }, lantern: { energyUnits: Math.max(0, Math.min(MAX_ENERGY_UNITS, state.lantern.energyUnits + (safe ? 400 : -48))) } };
   if (tick % 720 === 0 && next.availableStars.length + next.carriedStars.length < 28 && !next.pendingStarRespawn) next = { ...next, pendingStarRespawn: { dueTick: tick } };
killedBy: mutation-gap reducer boundary contracts distinguishes safe-zone and collision boundaries and reports gameplay events
statusReason: expected 952 to be 1400 // Object.is equality

[Killed] MethodExpression
src/game/reducer.ts:55:115
   if (state.phase !== 'playing') return { state, events: [] };
   const events: GameEvent[] = []; const tick = state.tick + 1; const playerCenterQ = movePlayer(state, action.movementQ);
   const safe = pixels(playerCenterQ, LIGHTHOUSE) <= SAFE_RADIUS;
-  let next: GameState = { ...state, tick, player: { centerQ: playerCenterQ }, lantern: { energyUnits: Math.max(0, Math.min(MAX_ENERGY_UNITS, state.lantern.energyUnits + (safe ? 400 : -48))) } };
+  let next: GameState = { ...state, tick, player: { centerQ: playerCenterQ }, lantern: { energyUnits: Math.max(0, Math.max(MAX_ENERGY_UNITS, state.lantern.energyUnits + (safe ? 400 : -48))) } };
   if (tick % 720 === 0 && next.availableStars.length + next.carriedStars.length < 28 && !next.pendingStarRespawn) next = { ...next, pendingStarRespawn: { dueTick: tick } };
   next = attemptStarRespawn(next, { currentTick: tick });
killedBy: world and reducer behavior uses every deterministic fallback direction for a coincident shadow
statusReason: expected { x: 118392968, y: 52428800 } to deeply equal { x: 118065288, y: 52428800 }

[Killed] ArithmeticOperator
src/game/reducer.ts:55:142
   if (state.phase !== 'playing') return { state, events: [] };
   const events: GameEvent[] = []; const tick = state.tick + 1; const playerCenterQ = movePlayer(state, action.movementQ);
   const safe = pixels(playerCenterQ, LIGHTHOUSE) <= SAFE_RADIUS;
-  let next: GameState = { ...state, tick, player: { centerQ: playerCenterQ }, lantern: { energyUnits: Math.max(0, Math.min(MAX_ENERGY_UNITS, state.lantern.energyUnits + (safe ? 400 : -48))) } };
+  let next: GameState = { ...state, tick, player: { centerQ: playerCenterQ }, lantern: { energyUnits: Math.max(0, Math.min(MAX_ENERGY_UNITS, state.lantern.energyUnits - (safe ? 400 : -48))) } };
   if (tick % 720 === 0 && next.availableStars.length + next.carriedStars.length < 28 && !next.pendingStarRespawn) next = { ...next, pendingStarRespawn: { dueTick: tick } };
   next = attemptStarRespawn(next, { currentTick: tick });
killedBy: mutation-gap reducer contracts collides at the inclusive radius only when the lantern is empty
statusReason: expected 'playing' to be 'lost' // Object.is equality

[Killed] EqualityOperator
src/game/reducer.ts:56:27
   const events: GameEvent[] = []; const tick = state.tick + 1; const playerCenterQ = movePlayer(state, action.movementQ);
   const safe = pixels(playerCenterQ, LIGHTHOUSE) <= SAFE_RADIUS;
   let next: GameState = { ...state, tick, player: { centerQ: playerCenterQ }, lantern: { energyUnits: Math.max(0, Math.min(MAX_ENERGY_UNITS, state.lantern.energyUnits + (safe ? 400 : -48))) } };
-  if (tick % 720 === 0 && next.availableStars.length + next.carriedStars.length < 28 && !next.pendingStarRespawn) next = { ...next, pendingStarRespawn: { dueTick: tick } };
+  if (tick % 720 === 0 && next.availableStars.length + next.carriedStars.length >= 28 && !next.pendingStarRespawn) next = { ...next, pendingStarRespawn: { dueTick: tick } };
   next = attemptStarRespawn(next, { currentTick: tick });
   next = spawnShadow(next, tick);
killedBy: mutation-gap reducer contracts creates and consumes a pending respawn only when the total star count is below 28
statusReason: expected [ Array(27) ] to have a length of 28 but got 27

[Killed] LogicalOperator
src/game/reducer.ts:56:7
   const events: GameEvent[] = []; const tick = state.tick + 1; const playerCenterQ = movePlayer(state, action.movementQ);
   const safe = pixels(playerCenterQ, LIGHTHOUSE) <= SAFE_RADIUS;
   let next: GameState = { ...state, tick, player: { centerQ: playerCenterQ }, lantern: { energyUnits: Math.max(0, Math.min(MAX_ENERGY_UNITS, state.lantern.energyUnits + (safe ? 400 : -48))) } };
-  if (tick % 720 === 0 && next.availableStars.length + next.carriedStars.length < 28 && !next.pendingStarRespawn) next = { ...next, pendingStarRespawn: { dueTick: tick } };
+  if (tick % 720 === 0 || next.availableStars.length + next.carriedStars.length < 28 && !next.pendingStarRespawn) next = { ...next, pendingStarRespawn: { dueTick: tick } };
   next = attemptStarRespawn(next, { currentTick: tick });
   next = spawnShadow(next, tick);
killedBy: mutation-gap reducer contracts picks up only within the inclusive radius and never exceeds five carried stars
statusReason: expected [ { id: 28, centerQ: { …(2) } } ] to deeply equal []

[Killed] MethodExpression
src/game/reducer.ts:59:32
   if (tick % 720 === 0 && next.availableStars.length + next.carriedStars.length < 28 && !next.pendingStarRespawn) next = { ...next, pendingStarRespawn: { dueTick: tick } };
   next = attemptStarRespawn(next, { currentTick: tick });
   next = spawnShadow(next, tick);
-  const newlySpawned = new Set(next.shadows.filter((shadow) => shadow.graceTicks === 21 && !state.shadows.some((before) => before.id === shadow.id)).map((shadow) => shadow.id));
+  const newlySpawned = new Set(next.shadows.map((shadow) => shadow.id));
   next = { ...next, shadows: next.shadows.map((shadow) => moveShadow(shadow, playerCenterQ, next.bankedStars, next.lantern.energyUnits > 0)) };
   const picked = next.availableStars.filter((star) => next.carriedStars.length < 5 && pixels(star.centerQ, playerCenterQ) <= 34);
killedBy: mutation-gap reducer contracts decrements ordinary shadow grace and never decrements newly spawned grace
statusReason: expected 5 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/game/reducer.ts:59:64
   if (tick % 720 === 0 && next.availableStars.length + next.carriedStars.length < 28 && !next.pendingStarRespawn) next = { ...next, pendingStarRespawn: { dueTick: tick } };
   next = attemptStarRespawn(next, { currentTick: tick });
   next = spawnShadow(next, tick);
-  const newlySpawned = new Set(next.shadows.filter((shadow) => shadow.graceTicks === 21 && !state.shadows.some((before) => before.id === shadow.id)).map((shadow) => shadow.id));
+  const newlySpawned = new Set(next.shadows.filter((shadow) => true).map((shadow) => shadow.id));
   next = { ...next, shadows: next.shadows.map((shadow) => moveShadow(shadow, playerCenterQ, next.bankedStars, next.lantern.energyUnits > 0)) };
   const picked = next.availableStars.filter((star) => next.carriedStars.length < 5 && pixels(star.centerQ, playerCenterQ) <= 34);
killedBy: mutation-gap reducer contracts decrements ordinary shadow grace and never decrements newly spawned grace
statusReason: expected 5 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/game/reducer.ts:60:111
   next = attemptStarRespawn(next, { currentTick: tick });
   next = spawnShadow(next, tick);
   const newlySpawned = new Set(next.shadows.filter((shadow) => shadow.graceTicks === 21 && !state.shadows.some((before) => before.id === shadow.id)).map((shadow) => shadow.id));
-  next = { ...next, shadows: next.shadows.map((shadow) => moveShadow(shadow, playerCenterQ, next.bankedStars, next.lantern.energyUnits > 0)) };
+  next = { ...next, shadows: next.shadows.map((shadow) => moveShadow(shadow, playerCenterQ, next.bankedStars, true)) };
   const picked = next.availableStars.filter((star) => next.carriedStars.length < 5 && pixels(star.centerQ, playerCenterQ) <= 34);
killedBy: fixed-step reducer contract loses on an eligible empty-lantern collision but not during grace
statusReason: expected 'playing' to be 'lost' // Object.is equality

[Killed] ArrowFunction
src/game/reducer.ts:60:47
   next = attemptStarRespawn(next, { currentTick: tick });
   next = spawnShadow(next, tick);
   const newlySpawned = new Set(next.shadows.filter((shadow) => shadow.graceTicks === 21 && !state.shadows.some((before) => before.id === shadow.id)).map((shadow) => shadow.id));
-  next = { ...next, shadows: next.shadows.map((shadow) => moveShadow(shadow, playerCenterQ, next.bankedStars, next.lantern.energyUnits > 0)) };
+  next = { ...next, shadows: next.shadows.map(() => undefined) };
   const picked = next.availableStars.filter((star) => next.carriedStars.length < 5 && pixels(star.centerQ, playerCenterQ) <= 34);
killedBy: fixed-step reducer contract uses the exact signed Q16.16 per-tick shadow displacement
statusReason: Cannot read properties of undefined (reading 'graceTicks')

[Killed] ConditionalExpression
src/game/reducer.ts:61:55
   next = spawnShadow(next, tick);
   const newlySpawned = new Set(next.shadows.filter((shadow) => shadow.graceTicks === 21 && !state.shadows.some((before) => before.id === shadow.id)).map((shadow) => shadow.id));
   next = { ...next, shadows: next.shadows.map((shadow) => moveShadow(shadow, playerCenterQ, next.bankedStars, next.lantern.energyUnits > 0)) };
-  const picked = next.availableStars.filter((star) => next.carriedStars.length < 5 && pixels(star.centerQ, playerCenterQ) <= 34);
+  const picked = next.availableStars.filter((star) => true);
   if (pixels(playerCenterQ, LIGHTHOUSE) <= DEPOSIT_RADIUS && next.carriedStars.length) {
killedBy: fixed-step reducer contract creates no shadow before tick 720 and creates at most the eligible target on cadence
statusReason: expected 1 to be 719 // Object.is equality

[Killed] ConditionalExpression
src/game/reducer.ts:61:55
   next = spawnShadow(next, tick);
   const newlySpawned = new Set(next.shadows.filter((shadow) => shadow.graceTicks === 21 && !state.shadows.some((before) => before.id === shadow.id)).map((shadow) => shadow.id));
   next = { ...next, shadows: next.shadows.map((shadow) => moveShadow(shadow, playerCenterQ, next.bankedStars, next.lantern.energyUnits > 0)) };
-  const picked = next.availableStars.filter((star) => next.carriedStars.length < 5 && pixels(star.centerQ, playerCenterQ) <= 34);
+  const picked = next.availableStars.filter((star) => true && pixels(star.centerQ, playerCenterQ) <= 34);
   if (pixels(playerCenterQ, LIGHTHOUSE) <= DEPOSIT_RADIUS && next.carriedStars.length) {
killedBy: mutation-gap reducer contracts picks up only within the inclusive radius and never exceeds five carried stars
statusReason: expected [ 1, 2, 3, 4, 5, 99 ] to have a length of 5 but got 6

[Killed] LogicalOperator
src/game/reducer.ts:63:7
   next = { ...next, shadows: next.shadows.map((shadow) => moveShadow(shadow, playerCenterQ, next.bankedStars, next.lantern.energyUnits > 0)) };
   const picked = next.availableStars.filter((star) => next.carriedStars.length < 5 && pixels(star.centerQ, playerCenterQ) <= 34);
-  if (pixels(playerCenterQ, LIGHTHOUSE) <= DEPOSIT_RADIUS && next.carriedStars.length) {
+  if (pixels(playerCenterQ, LIGHTHOUSE) <= DEPOSIT_RADIUS || next.carriedStars.length) {
     const depositedStars = next.carriedStars.length; const preRefillEnergyUnits = next.lantern.energyUnits;
killedBy: world and reducer behavior re-evaluates reducer helper functions after module reset
statusReason: expected 60000 to be 1400 // Object.is equality

[Killed] EqualityOperator
src/game/reducer.ts:63:7
   next = { ...next, shadows: next.shadows.map((shadow) => moveShadow(shadow, playerCenterQ, next.bankedStars, next.lantern.energyUnits > 0)) };
   const picked = next.availableStars.filter((star) => next.carriedStars.length < 5 && pixels(star.centerQ, playerCenterQ) <= 34);
-  if (pixels(playerCenterQ, LIGHTHOUSE) <= DEPOSIT_RADIUS && next.carriedStars.length) {
+  if (pixels(playerCenterQ, LIGHTHOUSE) > DEPOSIT_RADIUS && next.carriedStars.length) {
     const depositedStars = next.carriedStars.length; const preRefillEnergyUnits = next.lantern.energyUnits;
killedBy: mutation-gap reducer contracts picks up only within the inclusive radius and never exceeds five carried stars
statusReason: expected [] to deeply equal [ 99 ]

[Killed] ConditionalExpression
src/game/reducer.ts:67:7
     const depositedStars = next.carriedStars.length; const preRefillEnergyUnits = next.lantern.energyUnits;
   }
-  if (next.bankedStars >= 20) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
+  if (false) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
   const collision = next.shadows.find((shadow) => shadow.graceTicks === 0 && pixels(shadow.centerQ, playerCenterQ) <= PLAYER_RADIUS + SHADOW_RADIUS);
   if (next.lantern.energyUnits === 0 && collision) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
killedBy: fixed-step reducer contract deposits, refills, scores from pre-refill energy, and wins on an overshooting goal
statusReason: expected 1635 to be 5835 // Object.is equality

[Killed] EqualityOperator
src/game/reducer.ts:67:7
     const depositedStars = next.carriedStars.length; const preRefillEnergyUnits = next.lantern.energyUnits;
   }
-  if (next.bankedStars >= 20) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
+  if (next.bankedStars < 20) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
   const collision = next.shadows.find((shadow) => shadow.graceTicks === 0 && pixels(shadow.centerQ, playerCenterQ) <= PLAYER_RADIUS + SHADOW_RADIUS);
   if (next.lantern.energyUnits === 0 && collision) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
killedBy: fixed-step reducer contract increments only active ticks and drains exact integer lantern units outside safety
statusReason: expected 1 to be 60 // Object.is equality

[Killed] ArrowFunction
src/game/reducer.ts:68:39
   }
   if (next.bankedStars >= 20) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
-  const collision = next.shadows.find((shadow) => shadow.graceTicks === 0 && pixels(shadow.centerQ, playerCenterQ) <= PLAYER_RADIUS + SHADOW_RADIUS);
+  const collision = next.shadows.find(() => undefined);
   if (next.lantern.energyUnits === 0 && collision) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
   next = { ...next, shadows: next.shadows.map((shadow) => newlySpawned.has(shadow.id) || shadow.graceTicks === 21 ? shadow : { ...shadow, graceTicks: Math.max(0, shadow.graceTicks - 1) }) };
killedBy: fixed-step reducer contract loses on an eligible empty-lantern collision but not during grace
statusReason: expected 'playing' to be 'lost' // Object.is equality

[Killed] ConditionalExpression
src/game/reducer.ts:68:51
   }
   if (next.bankedStars >= 20) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
-  const collision = next.shadows.find((shadow) => shadow.graceTicks === 0 && pixels(shadow.centerQ, playerCenterQ) <= PLAYER_RADIUS + SHADOW_RADIUS);
+  const collision = next.shadows.find((shadow) => true);
   if (next.lantern.energyUnits === 0 && collision) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
   next = { ...next, shadows: next.shadows.map((shadow) => newlySpawned.has(shadow.id) || shadow.graceTicks === 21 ? shadow : { ...shadow, graceTicks: Math.max(0, shadow.graceTicks - 1) }) };
killedBy: fixed-step reducer contract loses on an eligible empty-lantern collision but not during grace
statusReason: expected 'lost' to be 'playing' // Object.is equality
