[Killed] LogicalOperator
src/game/reducer.ts:69:7
   }
   if (next.bankedStars >= 20) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
   const collision = next.shadows.find((shadow) => shadow.graceTicks === 0 && pixels(shadow.centerQ, playerCenterQ) <= PLAYER_RADIUS + SHADOW_RADIUS);
-  if (next.lantern.energyUnits === 0 && collision) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
+  if (next.lantern.energyUnits === 0 || collision) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
   next = { ...next, shadows: next.shadows.map((shadow) => newlySpawned.has(shadow.id) || shadow.graceTicks === 21 ? shadow : { ...shadow, graceTicks: Math.max(0, shadow.graceTicks - 1) }) };
   return { state: next, events };
killedBy: world and reducer behavior does not collide with an empty lantern when every shadow is far away
statusReason: expected 'lost' to be 'playing' // Object.is equality

[Killed] ConditionalExpression
src/game/reducer.ts:69:7
   }
   if (next.bankedStars >= 20) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
   const collision = next.shadows.find((shadow) => shadow.graceTicks === 0 && pixels(shadow.centerQ, playerCenterQ) <= PLAYER_RADIUS + SHADOW_RADIUS);
-  if (next.lantern.energyUnits === 0 && collision) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
+  if (false) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
   next = { ...next, shadows: next.shadows.map((shadow) => newlySpawned.has(shadow.id) || shadow.graceTicks === 21 ? shadow : { ...shadow, graceTicks: Math.max(0, shadow.graceTicks - 1) }) };
   return { state: next, events };
killedBy: fixed-step reducer contract loses on an eligible empty-lantern collision but not during grace
statusReason: expected 'playing' to be 'lost' // Object.is equality

[Killed] ArrowFunction
src/game/reducer.ts:70:47
   if (next.bankedStars >= 20) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
   const collision = next.shadows.find((shadow) => shadow.graceTicks === 0 && pixels(shadow.centerQ, playerCenterQ) <= PLAYER_RADIUS + SHADOW_RADIUS);
   if (next.lantern.energyUnits === 0 && collision) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
-  next = { ...next, shadows: next.shadows.map((shadow) => newlySpawned.has(shadow.id) || shadow.graceTicks === 21 ? shadow : { ...shadow, graceTicks: Math.max(0, shadow.graceTicks - 1) }) };
+  next = { ...next, shadows: next.shadows.map(() => undefined) };
   return { state: next, events };
 }
killedBy: world and reducer behavior uses every deterministic fallback direction for a coincident shadow
statusReason: Cannot read properties of undefined (reading 'centerQ')

[Killed] EqualityOperator
src/game/reducer.ts:70:90
   if (next.bankedStars >= 20) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
   const collision = next.shadows.find((shadow) => shadow.graceTicks === 0 && pixels(shadow.centerQ, playerCenterQ) <= PLAYER_RADIUS + SHADOW_RADIUS);
   if (next.lantern.energyUnits === 0 && collision) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
-  next = { ...next, shadows: next.shadows.map((shadow) => newlySpawned.has(shadow.id) || shadow.graceTicks === 21 ? shadow : { ...shadow, graceTicks: Math.max(0, shadow.graceTicks - 1) }) };
+  next = { ...next, shadows: next.shadows.map((shadow) => newlySpawned.has(shadow.id) || shadow.graceTicks !== 21 ? shadow : { ...shadow, graceTicks: Math.max(0, shadow.graceTicks - 1) }) };
   return { state: next, events };
 }
killedBy: fixed-step reducer contract applies a lit-lantern repel once after pursuit and resets grace
statusReason: expected 20 to be 21 // Object.is equality
