[Killed] BlockStatement
src/game/rng.ts:5:46
 
 export type Rng = Readonly<{ nextU32: () => number; int: (min: number, max: number) => number; state: () => number }>;
 
-export function createRng(seed: number): Rng {
-  let value = (seed >>> 0) || FALLBACK_SEED;
-  const nextU32 = (): number => {
-    let x = value >>> 0;
-    x ^= (x << 13) >>> 0;
-    x ^= x >>> 17;
-    x ^= (x << 5) >>> 0;
-    value = x >>> 0;
-    return value;
-  };
-  const int = (min: number, max: number): number => {
-    if (!Number.isSafeInteger(min) || !Number.isSafeInteger(max) || min > max || max - min >= 2 ** 32) throw new Error('invalid rng range');
-    const span = max - min + 1;
-    const limit = Math.floor(0x1_0000_0000 / span) * span;
-    let output: number;
-    do output = nextU32(); while (output >= limit);
-    return min + (output % span);
-  };
-  return Object.freeze({ nextU32, int, state: () => value });
-}
+export function createRng(seed: number): Rng {}
 
killedBy: mutation-gap RNG contracts rejects every invalid inclusive range boundary
statusReason: expected [Function] to throw error including 'invalid rng range' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/game/rng.ts:6:15
 export type Rng = Readonly<{ nextU32: () => number; int: (min: number, max: number) => number; state: () => number }>;
 
 export function createRng(seed: number): Rng {
-  let value = (seed >>> 0) || FALLBACK_SEED;
+  let value = false;
   const nextU32 = (): number => {
     let x = value >>> 0;
killedBy: mutation-gap RNG contracts keeps deterministic inclusive mapping for several spans
statusReason: expected [ +0, +0, +0, +0, +0 ] to deeply equal [ 1, 1, +0, +0, +0 ]

[Killed] ConditionalExpression
src/game/rng.ts:6:15
 export type Rng = Readonly<{ nextU32: () => number; int: (min: number, max: number) => number; state: () => number }>;
 
 export function createRng(seed: number): Rng {
-  let value = (seed >>> 0) || FALLBACK_SEED;
+  let value = true;
   const nextU32 = (): number => {
     let x = value >>> 0;
killedBy: RNG rejection behavior rejects an output exactly at the unbiased limit before mapping it
statusReason: expected 270369 to be 4294967295 // Object.is equality

[Killed] BlockStatement
src/game/rng.ts:7:33
 
 export function createRng(seed: number): Rng {
   let value = (seed >>> 0) || FALLBACK_SEED;
-  const nextU32 = (): number => {
-    let x = value >>> 0;
-    x ^= (x << 13) >>> 0;
-    x ^= x >>> 17;
-    x ^= (x << 5) >>> 0;
-    value = x >>> 0;
-    return value;
-  };
+  const nextU32 = (): number => {};
   const int = (min: number, max: number): number => {
     if (!Number.isSafeInteger(min) || !Number.isSafeInteger(max) || min > max || max - min >= 2 ** 32) throw new Error('invalid rng range');
killedBy: mutation-gap RNG contracts rejects every invalid inclusive range boundary
statusReason: expected NaN to be 7 // Object.is equality

[Killed] BlockStatement
src/game/rng.ts:15:53
     value = x >>> 0;
     return value;
   };
-  const int = (min: number, max: number): number => {
-    if (!Number.isSafeInteger(min) || !Number.isSafeInteger(max) || min > max || max - min >= 2 ** 32) throw new Error('invalid rng range');
-    const span = max - min + 1;
-    const limit = Math.floor(0x1_0000_0000 / span) * span;
-    let output: number;
-    do output = nextU32(); while (output >= limit);
-    return min + (output % span);
-  };
+  const int = (min: number, max: number): number => {};
   return Object.freeze({ nextU32, int, state: () => value });
 }
killedBy: RNG rejection behavior rejects a range whose width reaches the 32-bit domain
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/game/rng.ts:16:39
     return value;
   };
   const int = (min: number, max: number): number => {
-    if (!Number.isSafeInteger(min) || !Number.isSafeInteger(max) || min > max || max - min >= 2 ** 32) throw new Error('invalid rng range');
+    if (!Number.isSafeInteger(min) || Number.isSafeInteger(max) || min > max || max - min >= 2 ** 32) throw new Error('invalid rng range');
     const span = max - min + 1;
     const limit = Math.floor(0x1_0000_0000 / span) * span;
killedBy: mutation-gap RNG contracts rejects every invalid inclusive range boundary
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/game/rng.ts:16:9
     return value;
   };
   const int = (min: number, max: number): number => {
-    if (!Number.isSafeInteger(min) || !Number.isSafeInteger(max) || min > max || max - min >= 2 ** 32) throw new Error('invalid rng range');
+    if ((!Number.isSafeInteger(min) || !Number.isSafeInteger(max)) && min > max || max - min >= 2 ** 32) throw new Error('invalid rng range');
     const span = max - min + 1;
     const limit = Math.floor(0x1_0000_0000 / span) * span;
killedBy: mutation-gap RNG contracts rejects every invalid inclusive range boundary
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
src/game/rng.ts:17:18
   };
   const int = (min: number, max: number): number => {
     if (!Number.isSafeInteger(min) || !Number.isSafeInteger(max) || min > max || max - min >= 2 ** 32) throw new Error('invalid rng range');
-    const span = max - min + 1;
+    const span = max + min + 1;
     const limit = Math.floor(0x1_0000_0000 / span) * span;
     let output: number;
killedBy: mutation-gap RNG contracts rejects every invalid inclusive range boundary
statusReason: expected 16 to be 7 // Object.is equality

[Killed] ArithmeticOperator
src/game/rng.ts:17:18
   };
   const int = (min: number, max: number): number => {
     if (!Number.isSafeInteger(min) || !Number.isSafeInteger(max) || min > max || max - min >= 2 ** 32) throw new Error('invalid rng range');
-    const span = max - min + 1;
+    const span = max - min - 1;
     const limit = Math.floor(0x1_0000_0000 / span) * span;
     let output: number;
killedBy: mutation-gap RNG contracts keeps deterministic inclusive mapping for several spans
statusReason: expected [ NaN, NaN, NaN, NaN, NaN ] to deeply equal [ 1, 1, +0, +0, +0 ]

[Killed] ArithmeticOperator
src/game/rng.ts:18:30
   const int = (min: number, max: number): number => {
     if (!Number.isSafeInteger(min) || !Number.isSafeInteger(max) || min > max || max - min >= 2 ** 32) throw new Error('invalid rng range');
     const span = max - min + 1;
-    const limit = Math.floor(0x1_0000_0000 / span) * span;
+    const limit = Math.floor(0x1_0000_0000 * span) * span;
     let output: number;
     do output = nextU32(); while (output >= limit);
killedBy: RNG rejection behavior rejects an output exactly at the unbiased limit before mapping it
statusReason: expected +0 to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/game/rng.ts:18:19
   const int = (min: number, max: number): number => {
     if (!Number.isSafeInteger(min) || !Number.isSafeInteger(max) || min > max || max - min >= 2 ** 32) throw new Error('invalid rng range');
     const span = max - min + 1;
-    const limit = Math.floor(0x1_0000_0000 / span) * span;
+    const limit = Math.floor(0x1_0000_0000 / span) / span;
     let output: number;
     do output = nextU32(); while (output >= limit);
killedBy: mutation-gap RNG contracts keeps deterministic inclusive mapping for several spans
statusReason: expected [ 1, +0, +0, 1, 1 ] to deeply equal [ 1, 1, +0, +0, +0 ]

[Killed] ConditionalExpression
src/game/rng.ts:20:35
     const span = max - min + 1;
     const limit = Math.floor(0x1_0000_0000 / span) * span;
     let output: number;
-    do output = nextU32(); while (output >= limit);
+    do output = nextU32(); while (false);
     return min + (output % span);
   };
killedBy: RNG rejection behavior rejects an output exactly at the unbiased limit before mapping it
statusReason: expected +0 to be 3 // Object.is equality

[Killed] EqualityOperator
src/game/rng.ts:20:35
     const span = max - min + 1;
     const limit = Math.floor(0x1_0000_0000 / span) * span;
     let output: number;
-    do output = nextU32(); while (output >= limit);
+    do output = nextU32(); while (output > limit);
     return min + (output % span);
   };
killedBy: RNG rejection behavior rejects an output exactly at the unbiased limit before mapping it
statusReason: expected +0 to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/game/rng.ts:21:12
     const limit = Math.floor(0x1_0000_0000 / span) * span;
     let output: number;
     do output = nextU32(); while (output >= limit);
-    return min + (output % span);
+    return min - output % span;
   };
   return Object.freeze({ nextU32, int, state: () => value });
killedBy: RNG rejection behavior rejects an output exactly at the unbiased limit before mapping it
statusReason: expected -3 to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/game/rng.ts:21:19
     const limit = Math.floor(0x1_0000_0000 / span) * span;
     let output: number;
     do output = nextU32(); while (output >= limit);
-    return min + (output % span);
+    return min + (output * span);
   };
   return Object.freeze({ nextU32, int, state: () => value });
killedBy: mutation-gap RNG contracts rejects every invalid inclusive range boundary
statusReason: expected 270376 to be 7 // Object.is equality

[Killed] ArrowFunction
src/game/rng.ts:23:47
     do output = nextU32(); while (output >= limit);
     return min + (output % span);
   };
-  return Object.freeze({ nextU32, int, state: () => value });
+  return Object.freeze({ nextU32, int, state: () => undefined });
 }
 
killedBy: RNG rejection behavior rejects an output exactly at the unbiased limit before mapping it
statusReason: expected undefined to be 253983 // Object.is equality

[Killed] ObjectLiteral
src/game/rng.ts:23:24
     do output = nextU32(); while (output >= limit);
     return min + (output % span);
   };
-  return Object.freeze({ nextU32, int, state: () => value });
+  return Object.freeze({});
 }
 
killedBy: RNG rejection behavior rejects a range whose width reaches the 32-bit domain
statusReason: expected [Function] to throw error including 'invalid rng range' but got '(0 , __vite_ssr_import_4__.createRng)…'
