[Killed] BlockStatement
src/game/scoring.ts:1:103
-export function scoreDeposit(input: { depositedStars: number; preRefillEnergyUnits: number }): number {
-  return 100 * input.depositedStars + 25 * input.depositedStars ** 2 + 10 * Math.floor(input.preRefillEnergyUnits / 600);
-}
+export function scoreDeposit(input: { depositedStars: number; preRefillEnergyUnits: number }): number {}
 export function scoreWinBonus(tick: number): number {
   return Math.max(0, 4_200 - 10 * Math.floor(tick / 60));
killedBy: fixed-step reducer contract deposits, refills, scores from pre-refill energy, and wins on an overshooting goal
statusReason: expected NaN to be 5835 // Object.is equality

[Killed] ArithmeticOperator
src/game/scoring.ts:2:39
 export function scoreDeposit(input: { depositedStars: number; preRefillEnergyUnits: number }): number {
-  return 100 * input.depositedStars + 25 * input.depositedStars ** 2 + 10 * Math.floor(input.preRefillEnergyUnits / 600);
+  return 100 * input.depositedStars + 25 / input.depositedStars ** 2 + 10 * Math.floor(input.preRefillEnergyUnits / 600);
 }
 export function scoreWinBonus(tick: number): number {
killedBy: fixed-step reducer contract deposits, refills, scores from pre-refill energy, and wins on an overshooting goal
statusReason: expected 5211 to be 5835 // Object.is equality

[Killed] ArithmeticOperator
src/game/scoring.ts:2:88
 export function scoreDeposit(input: { depositedStars: number; preRefillEnergyUnits: number }): number {
-  return 100 * input.depositedStars + 25 * input.depositedStars ** 2 + 10 * Math.floor(input.preRefillEnergyUnits / 600);
+  return 100 * input.depositedStars + 25 * input.depositedStars ** 2 + 10 * Math.floor(input.preRefillEnergyUnits * 600);
 }
 export function scoreWinBonus(tick: number): number {
killedBy: fixed-step reducer contract deposits, refills, scores from pre-refill energy, and wins on an overshooting goal
statusReason: expected 185999325 to be 5835 // Object.is equality

[Killed] BlockStatement
src/game/scoring.ts:4:53
 export function scoreDeposit(input: { depositedStars: number; preRefillEnergyUnits: number }): number {
   return 100 * input.depositedStars + 25 * input.depositedStars ** 2 + 10 * Math.floor(input.preRefillEnergyUnits / 600);
 }
-export function scoreWinBonus(tick: number): number {
-  return Math.max(0, 4_200 - 10 * Math.floor(tick / 60));
-}
+export function scoreWinBonus(tick: number): number {}
 
killedBy: fixed-step reducer contract deposits, refills, scores from pre-refill energy, and wins on an overshooting goal
statusReason: expected NaN to be 5835 // Object.is equality

[Killed] MethodExpression
src/game/scoring.ts:5:10
   return 100 * input.depositedStars + 25 * input.depositedStars ** 2 + 10 * Math.floor(input.preRefillEnergyUnits / 600);
 }
 export function scoreWinBonus(tick: number): number {
-  return Math.max(0, 4_200 - 10 * Math.floor(tick / 60));
+  return Math.min(0, 4_200 - 10 * Math.floor(tick / 60));
 }
 
killedBy: fixed-step reducer contract deposits, refills, scores from pre-refill energy, and wins on an overshooting goal
statusReason: expected 1635 to be 5835 // Object.is equality

[Killed] ArithmeticOperator
src/game/scoring.ts:5:22
   return 100 * input.depositedStars + 25 * input.depositedStars ** 2 + 10 * Math.floor(input.preRefillEnergyUnits / 600);
 }
 export function scoreWinBonus(tick: number): number {
-  return Math.max(0, 4_200 - 10 * Math.floor(tick / 60));
+  return Math.max(0, 4_200 + 10 * Math.floor(tick / 60));
 }
 
killedBy: score formulas clamps the win speed bonus at zero after seven minutes
statusReason: expected 8400 to be +0 // Object.is equality
