[Killed] BlockStatement
src/game/spawn.ts:7:57
 type Candidate = { centerQ: VectorQ; rngState: number };
 type RespawnOptions = { currentTick: number; nextCandidate?: () => Candidate };
 
-function distancePixels(a: VectorQ, b: VectorQ): number {
-  return Math.hypot(a.x - b.x, a.y - b.y) / Q;
-}
+function distancePixels(a: VectorQ, b: VectorQ): number {}
 
 function validStar(state: GameState, centerQ: VectorQ): boolean {
killedBy: fixed-step reducer contract defers exactly 32 rejected respawn candidates by 60 active ticks without allocating an ID
statusReason: expected 1 to be 32 // Object.is equality

[Killed] ArithmeticOperator
src/game/spawn.ts:8:10
 type RespawnOptions = { currentTick: number; nextCandidate?: () => Candidate };
 
 function distancePixels(a: VectorQ, b: VectorQ): number {
-  return Math.hypot(a.x - b.x, a.y - b.y) / Q;
+  return Math.hypot(a.x - b.x, a.y - b.y) * Q;
 }
 
killedBy: mutation-gap respawn geometry contracts rejects each forbidden star neighborhood before accepting a safe candidate
statusReason: expected 1 to be 5 // Object.is equality

[Killed] ArithmeticOperator
src/game/spawn.ts:8:21
 type RespawnOptions = { currentTick: number; nextCandidate?: () => Candidate };
 
 function distancePixels(a: VectorQ, b: VectorQ): number {
-  return Math.hypot(a.x - b.x, a.y - b.y) / Q;
+  return Math.hypot(a.x + b.x, a.y - b.y) / Q;
 }
 
killedBy: fixed-step reducer contract defers exactly 32 rejected respawn candidates by 60 active ticks without allocating an ID
statusReason: expected 1 to be 32 // Object.is equality

[Killed] BlockStatement
src/game/spawn.ts:11:65
   return Math.hypot(a.x - b.x, a.y - b.y) / Q;
 }
 
-function validStar(state: GameState, centerQ: VectorQ): boolean {
-  if (distancePixels(centerQ, LIGHTHOUSE) <= 300 || distancePixels(centerQ, state.player.centerQ) < 260) return false;
-  if (state.shadows.some((shadow) => distancePixels(centerQ, shadow.centerQ) < 180)) return false;
-  if (state.availableStars.some((star) => distancePixels(centerQ, star.centerQ) <= 100)) return false;
-  const x = centerQ.x / Q; const y = centerQ.y / Q;
-  return x >= 34 && x <= 2366 && y >= 34 && y <= 1566 && !state.obstacles.some((item) => x >= item.x - 34 && x <= item.x + item.width + 34 && y >= item.y - 34 && y <= item.y + item.height + 34);
-}
+function validStar(state: GameState, centerQ: VectorQ): boolean {}
 
 export function attemptStarRespawn(state: GameState, options: RespawnOptions): GameState {
killedBy: mutation-gap reducer contracts creates and consumes a pending respawn only when the total star count is below 28
statusReason: expected [ Array(27) ] to have a length of 28 but got 27

[Killed] ConditionalExpression
src/game/spawn.ts:12:7
 }
 
 function validStar(state: GameState, centerQ: VectorQ): boolean {
-  if (distancePixels(centerQ, LIGHTHOUSE) <= 300 || distancePixels(centerQ, state.player.centerQ) < 260) return false;
+  if (true) return false;
   if (state.shadows.some((shadow) => distancePixels(centerQ, shadow.centerQ) < 180)) return false;
   if (state.availableStars.some((star) => distancePixels(centerQ, star.centerQ) <= 100)) return false;
killedBy: star respawn identity allocates the current ID and advances it exactly once
statusReason: expected [] to deeply equal [ { id: 40, centerQ: { …(2) } } ]

[Killed] BooleanLiteral
src/game/spawn.ts:12:113
 }
 
 function validStar(state: GameState, centerQ: VectorQ): boolean {
-  if (distancePixels(centerQ, LIGHTHOUSE) <= 300 || distancePixels(centerQ, state.player.centerQ) < 260) return false;
+  if (distancePixels(centerQ, LIGHTHOUSE) <= 300 || distancePixels(centerQ, state.player.centerQ) < 260) return true;
   if (state.shadows.some((shadow) => distancePixels(centerQ, shadow.centerQ) < 180)) return false;
   if (state.availableStars.some((star) => distancePixels(centerQ, star.centerQ) <= 100)) return false;
killedBy: mutation-gap respawn geometry contracts rejects each forbidden star neighborhood before accepting a safe candidate
statusReason: expected 1 to be 5 // Object.is equality

[Killed] ArrowFunction
src/game/spawn.ts:13:26
 
 function validStar(state: GameState, centerQ: VectorQ): boolean {
   if (distancePixels(centerQ, LIGHTHOUSE) <= 300 || distancePixels(centerQ, state.player.centerQ) < 260) return false;
-  if (state.shadows.some((shadow) => distancePixels(centerQ, shadow.centerQ) < 180)) return false;
+  if (state.shadows.some(() => undefined)) return false;
   if (state.availableStars.some((star) => distancePixels(centerQ, star.centerQ) <= 100)) return false;
   const x = centerQ.x / Q; const y = centerQ.y / Q;
killedBy: mutation-gap respawn geometry contracts rejects each forbidden star neighborhood before accepting a safe candidate
statusReason: expected 3 to be 5 // Object.is equality

[Killed] BooleanLiteral
src/game/spawn.ts:13:93
 
 function validStar(state: GameState, centerQ: VectorQ): boolean {
   if (distancePixels(centerQ, LIGHTHOUSE) <= 300 || distancePixels(centerQ, state.player.centerQ) < 260) return false;
-  if (state.shadows.some((shadow) => distancePixels(centerQ, shadow.centerQ) < 180)) return false;
+  if (state.shadows.some((shadow) => distancePixels(centerQ, shadow.centerQ) < 180)) return true;
   if (state.availableStars.some((star) => distancePixels(centerQ, star.centerQ) <= 100)) return false;
   const x = centerQ.x / Q; const y = centerQ.y / Q;
killedBy: mutation-gap respawn geometry contracts rejects each forbidden star neighborhood before accepting a safe candidate
statusReason: expected 3 to be 5 // Object.is equality

[Killed] ConditionalExpression
src/game/spawn.ts:14:7
 function validStar(state: GameState, centerQ: VectorQ): boolean {
   if (distancePixels(centerQ, LIGHTHOUSE) <= 300 || distancePixels(centerQ, state.player.centerQ) < 260) return false;
   if (state.shadows.some((shadow) => distancePixels(centerQ, shadow.centerQ) < 180)) return false;
-  if (state.availableStars.some((star) => distancePixels(centerQ, star.centerQ) <= 100)) return false;
+  if (true) return false;
   const x = centerQ.x / Q; const y = centerQ.y / Q;
   return x >= 34 && x <= 2366 && y >= 34 && y <= 1566 && !state.obstacles.some((item) => x >= item.x - 34 && x <= item.x + item.width + 34 && y >= item.y - 34 && y <= item.y + item.height + 34);
killedBy: mutation-gap reducer contracts creates and consumes a pending respawn only when the total star count is below 28
statusReason: expected [ Array(27) ] to have a length of 28 but got 27

[Killed] ArrowFunction
src/game/spawn.ts:14:33
 function validStar(state: GameState, centerQ: VectorQ): boolean {
   if (distancePixels(centerQ, LIGHTHOUSE) <= 300 || distancePixels(centerQ, state.player.centerQ) < 260) return false;
   if (state.shadows.some((shadow) => distancePixels(centerQ, shadow.centerQ) < 180)) return false;
-  if (state.availableStars.some((star) => distancePixels(centerQ, star.centerQ) <= 100)) return false;
+  if (state.availableStars.some(() => undefined)) return false;
   const x = centerQ.x / Q; const y = centerQ.y / Q;
   return x >= 34 && x <= 2366 && y >= 34 && y <= 1566 && !state.obstacles.some((item) => x >= item.x - 34 && x <= item.x + item.width + 34 && y >= item.y - 34 && y <= item.y + item.height + 34);
killedBy: mutation-gap respawn geometry contracts enforces every inclusive respawn boundary and expanded obstacle boundary
statusReason: expected [ { id: 1, centerQ: { …(2) } }, …(1) ] to deeply equal [ { id: 1, centerQ: { …(2) } } ]

[Killed] ArithmeticOperator
src/game/spawn.ts:15:38
   if (distancePixels(centerQ, LIGHTHOUSE) <= 300 || distancePixels(centerQ, state.player.centerQ) < 260) return false;
   if (state.shadows.some((shadow) => distancePixels(centerQ, shadow.centerQ) < 180)) return false;
   if (state.availableStars.some((star) => distancePixels(centerQ, star.centerQ) <= 100)) return false;
-  const x = centerQ.x / Q; const y = centerQ.y / Q;
+  const x = centerQ.x / Q; const y = centerQ.y * Q;
   return x >= 34 && x <= 2366 && y >= 34 && y <= 1566 && !state.obstacles.some((item) => x >= item.x - 34 && x <= item.x + item.width + 34 && y >= item.y - 34 && y <= item.y + item.height + 34);
 }
killedBy: mutation-gap reducer contracts creates and consumes a pending respawn only when the total star count is below 28
statusReason: expected [ Array(27) ] to have a length of 28 but got 27

[Killed] ArithmeticOperator
src/game/spawn.ts:15:13
   if (distancePixels(centerQ, LIGHTHOUSE) <= 300 || distancePixels(centerQ, state.player.centerQ) < 260) return false;
   if (state.shadows.some((shadow) => distancePixels(centerQ, shadow.centerQ) < 180)) return false;
   if (state.availableStars.some((star) => distancePixels(centerQ, star.centerQ) <= 100)) return false;
-  const x = centerQ.x / Q; const y = centerQ.y / Q;
+  const x = centerQ.x * Q; const y = centerQ.y / Q;
   return x >= 34 && x <= 2366 && y >= 34 && y <= 1566 && !state.obstacles.some((item) => x >= item.x - 34 && x <= item.x + item.width + 34 && y >= item.y - 34 && y <= item.y + item.height + 34);
 }
killedBy: mutation-gap reducer contracts creates and consumes a pending respawn only when the total star count is below 28
statusReason: expected [ Array(27) ] to have a length of 28 but got 27

[Killed] EqualityOperator
src/game/spawn.ts:16:45
   if (state.shadows.some((shadow) => distancePixels(centerQ, shadow.centerQ) < 180)) return false;
   if (state.availableStars.some((star) => distancePixels(centerQ, star.centerQ) <= 100)) return false;
   const x = centerQ.x / Q; const y = centerQ.y / Q;
-  return x >= 34 && x <= 2366 && y >= 34 && y <= 1566 && !state.obstacles.some((item) => x >= item.x - 34 && x <= item.x + item.width + 34 && y >= item.y - 34 && y <= item.y + item.height + 34);
+  return x >= 34 && x <= 2366 && y >= 34 && y > 1566 && !state.obstacles.some((item) => x >= item.x - 34 && x <= item.x + item.width + 34 && y >= item.y - 34 && y <= item.y + item.height + 34);
 }
 
killedBy: mutation-gap reducer contracts creates and consumes a pending respawn only when the total star count is below 28
statusReason: expected [ Array(27) ] to have a length of 28 but got 27

[Killed] EqualityOperator
src/game/spawn.ts:16:21
   if (state.shadows.some((shadow) => distancePixels(centerQ, shadow.centerQ) < 180)) return false;
   if (state.availableStars.some((star) => distancePixels(centerQ, star.centerQ) <= 100)) return false;
   const x = centerQ.x / Q; const y = centerQ.y / Q;
-  return x >= 34 && x <= 2366 && y >= 34 && y <= 1566 && !state.obstacles.some((item) => x >= item.x - 34 && x <= item.x + item.width + 34 && y >= item.y - 34 && y <= item.y + item.height + 34);
+  return x >= 34 && x < 2366 && y >= 34 && y <= 1566 && !state.obstacles.some((item) => x >= item.x - 34 && x <= item.x + item.width + 34 && y >= item.y - 34 && y <= item.y + item.height + 34);
 }
 
killedBy: mutation-gap respawn geometry contracts enforces every inclusive respawn boundary and expanded obstacle boundary
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/game/spawn.ts:19:90
   return x >= 34 && x <= 2366 && y >= 34 && y <= 1566 && !state.obstacles.some((item) => x >= item.x - 34 && x <= item.x + item.width + 34 && y >= item.y - 34 && y <= item.y + item.height + 34);
 }
 
-export function attemptStarRespawn(state: GameState, options: RespawnOptions): GameState {
-  if (!state.pendingStarRespawn || state.pendingStarRespawn.dueTick !== options.currentTick) return state;
-  let rngState = state.rngState;
-  for (let attempt = 0; attempt < 32; attempt += 1) {
-    const candidate = options.nextCandidate?.() ?? { centerQ: { x: 2_100 * Q, y: 1_200 * Q }, rngState };
-    rngState = candidate.rngState;
-    if (validStar(state, candidate.centerQ)) {
-      const star: Star = { id: state.nextStarId, centerQ: candidate.centerQ };
-      return { ...state, rngState, availableStars: [...state.availableStars, star], nextStarId: state.nextStarId + 1, pendingStarRespawn: undefined };
-    }
-  }
-  return { ...state, rngState, pendingStarRespawn: { dueTick: options.currentTick + 60 } };
-}
+export function attemptStarRespawn(state: GameState, options: RespawnOptions): GameState {}
 
killedBy: mutation-gap reducer contracts clamps player motion independently at all four world borders
statusReason: Cannot read properties of undefined (reading 'shadows')

[Killed] BooleanLiteral
src/game/spawn.ts:20:7
 }
 
 export function attemptStarRespawn(state: GameState, options: RespawnOptions): GameState {
-  if (!state.pendingStarRespawn || state.pendingStarRespawn.dueTick !== options.currentTick) return state;
+  if (state.pendingStarRespawn || state.pendingStarRespawn.dueTick !== options.currentTick) return state;
   let rngState = state.rngState;
   for (let attempt = 0; attempt < 32; attempt += 1) {
killedBy: mutation-gap reducer contracts clamps player motion independently at all four world borders
statusReason: Cannot read properties of undefined (reading 'dueTick')

[Killed] ConditionalExpression
src/game/spawn.ts:20:7
 }
 
 export function attemptStarRespawn(state: GameState, options: RespawnOptions): GameState {
-  if (!state.pendingStarRespawn || state.pendingStarRespawn.dueTick !== options.currentTick) return state;
+  if (true) return state;
   let rngState = state.rngState;
   for (let attempt = 0; attempt < 32; attempt += 1) {
killedBy: mutation-gap reducer contracts creates and consumes a pending respawn only when the total star count is below 28
statusReason: expected [ Array(27) ] to have a length of 28 but got 27

[Killed] BlockStatement
src/game/spawn.ts:22:53
 export function attemptStarRespawn(state: GameState, options: RespawnOptions): GameState {
   if (!state.pendingStarRespawn || state.pendingStarRespawn.dueTick !== options.currentTick) return state;
   let rngState = state.rngState;
-  for (let attempt = 0; attempt < 32; attempt += 1) {
-    const candidate = options.nextCandidate?.() ?? { centerQ: { x: 2_100 * Q, y: 1_200 * Q }, rngState };
-    rngState = candidate.rngState;
-    if (validStar(state, candidate.centerQ)) {
-      const star: Star = { id: state.nextStarId, centerQ: candidate.centerQ };
-      return { ...state, rngState, availableStars: [...state.availableStars, star], nextStarId: state.nextStarId + 1, pendingStarRespawn: undefined };
-    }
-  }
+  for (let attempt = 0; attempt < 32; attempt += 1) {}
   return { ...state, rngState, pendingStarRespawn: { dueTick: options.currentTick + 60 } };
 }
killedBy: star respawn identity allocates the current ID and advances it exactly once
statusReason: expected [] to deeply equal [ { id: 40, centerQ: { …(2) } } ]

[Killed] EqualityOperator
src/game/spawn.ts:22:25
 export function attemptStarRespawn(state: GameState, options: RespawnOptions): GameState {
   if (!state.pendingStarRespawn || state.pendingStarRespawn.dueTick !== options.currentTick) return state;
   let rngState = state.rngState;
-  for (let attempt = 0; attempt < 32; attempt += 1) {
+  for (let attempt = 0; attempt <= 32; attempt += 1) {
     const candidate = options.nextCandidate?.() ?? { centerQ: { x: 2_100 * Q, y: 1_200 * Q }, rngState };
     rngState = candidate.rngState;
killedBy: fixed-step reducer contract defers exactly 32 rejected respawn candidates by 60 active ticks without allocating an ID
statusReason: candidate source exhausted

[Killed] OptionalChaining
src/game/spawn.ts:23:23
   if (!state.pendingStarRespawn || state.pendingStarRespawn.dueTick !== options.currentTick) return state;
   let rngState = state.rngState;
   for (let attempt = 0; attempt < 32; attempt += 1) {
-    const candidate = options.nextCandidate?.() ?? { centerQ: { x: 2_100 * Q, y: 1_200 * Q }, rngState };
+    const candidate = options.nextCandidate() ?? { centerQ: { x: 2_100 * Q, y: 1_200 * Q }, rngState };
     rngState = candidate.rngState;
     if (validStar(state, candidate.centerQ)) {
killedBy: mutation-gap reducer contracts creates and consumes a pending respawn only when the total star count is below 28
statusReason: options.nextCandidate is not a function

[Killed] LogicalOperator
src/game/spawn.ts:23:23
   if (!state.pendingStarRespawn || state.pendingStarRespawn.dueTick !== options.currentTick) return state;
   let rngState = state.rngState;
   for (let attempt = 0; attempt < 32; attempt += 1) {
-    const candidate = options.nextCandidate?.() ?? { centerQ: { x: 2_100 * Q, y: 1_200 * Q }, rngState };
+    const candidate = options.nextCandidate?.() && {
+  centerQ: {
+    x: 2_100 * Q,
+    y: 1_200 * Q
+  },
+  rngState
+};
     rngState = candidate.rngState;
     if (validStar(state, candidate.centerQ)) {
killedBy: mutation-gap reducer contracts creates and consumes a pending respawn only when the total star count is below 28
statusReason: Cannot read properties of undefined (reading 'rngState')

[Killed] ConditionalExpression
src/game/spawn.ts:25:9
   for (let attempt = 0; attempt < 32; attempt += 1) {
     const candidate = options.nextCandidate?.() ?? { centerQ: { x: 2_100 * Q, y: 1_200 * Q }, rngState };
     rngState = candidate.rngState;
-    if (validStar(state, candidate.centerQ)) {
+    if (false) {
       const star: Star = { id: state.nextStarId, centerQ: candidate.centerQ };
       return { ...state, rngState, availableStars: [...state.availableStars, star], nextStarId: state.nextStarId + 1, pendingStarRespawn: undefined };
killedBy: mutation-gap reducer contracts creates and consumes a pending respawn only when the total star count is below 28
statusReason: expected [ Array(27) ] to have a length of 28 but got 27

[Killed] ConditionalExpression
src/game/spawn.ts:25:9
   for (let attempt = 0; attempt < 32; attempt += 1) {
     const candidate = options.nextCandidate?.() ?? { centerQ: { x: 2_100 * Q, y: 1_200 * Q }, rngState };
     rngState = candidate.rngState;
-    if (validStar(state, candidate.centerQ)) {
+    if (true) {
       const star: Star = { id: state.nextStarId, centerQ: candidate.centerQ };
       return { ...state, rngState, availableStars: [...state.availableStars, star], nextStarId: state.nextStarId + 1, pendingStarRespawn: undefined };
killedBy: mutation-gap respawn geometry contracts rejects each forbidden star neighborhood before accepting a safe candidate
statusReason: expected 1 to be 5 // Object.is equality

[Killed] ObjectLiteral
src/game/spawn.ts:26:26
     const candidate = options.nextCandidate?.() ?? { centerQ: { x: 2_100 * Q, y: 1_200 * Q }, rngState };
     rngState = candidate.rngState;
     if (validStar(state, candidate.centerQ)) {
-      const star: Star = { id: state.nextStarId, centerQ: candidate.centerQ };
+      const star: Star = {};
       return { ...state, rngState, availableStars: [...state.availableStars, star], nextStarId: state.nextStarId + 1, pendingStarRespawn: undefined };
     }
killedBy: mutation-gap reducer contracts creates and consumes a pending respawn only when the total star count is below 28
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] ArithmeticOperator
src/game/spawn.ts:27:97
     rngState = candidate.rngState;
     if (validStar(state, candidate.centerQ)) {
       const star: Star = { id: state.nextStarId, centerQ: candidate.centerQ };
-      return { ...state, rngState, availableStars: [...state.availableStars, star], nextStarId: state.nextStarId + 1, pendingStarRespawn: undefined };
+      return { ...state, rngState, availableStars: [...state.availableStars, star], nextStarId: state.nextStarId - 1, pendingStarRespawn: undefined };
     }
   }
killedBy: star respawn identity allocates the current ID and advances it exactly once
statusReason: expected 39 to be 41 // Object.is equality

[Killed] ArithmeticOperator
src/game/spawn.ts:30:63
       return { ...state, rngState, availableStars: [...state.availableStars, star], nextStarId: state.nextStarId + 1, pendingStarRespawn: undefined };
     }
   }
-  return { ...state, rngState, pendingStarRespawn: { dueTick: options.currentTick + 60 } };
+  return { ...state, rngState, pendingStarRespawn: { dueTick: options.currentTick - 60 } };
 }
 
killedBy: mutation-gap respawn geometry contracts defers a missing candidate source safely and retries after the documented delay
statusReason: expected -50 to be 70 // Object.is equality
