[Killed] ArrayDeclaration
src/game/world.ts:6:3
 import type { GameState, Obstacle, Star } from './types';
 
 const obstacleLayout: ReadonlyArray<readonly [number, number, number, number]> = [
-  [100, 100, 160, 128], [420, 100, 176, 112], [760, 100, 144, 160], [1080, 100, 160, 128],
+  [], [420, 100, 176, 112], [760, 100, 144, 160], [1080, 100, 160, 128],
   [1400, 100, 176, 112], [1740, 100, 144, 160], [2060, 100, 160, 128], [100, 420, 160, 128],
   [2140, 420, 160, 128], [100, 740, 160, 128], [2140, 740, 160, 128], [100, 1060, 160, 128],
killedBy: world and reducer behavior re-evaluates every fixed obstacle row after module reset
statusReason: expected [ …(24) ] to deeply equal [ [ +0, 100, 100, 160, 128 ], …(23) ]

[Killed] ArrayDeclaration
src/game/world.ts:6:47
 import type { GameState, Obstacle, Star } from './types';
 
 const obstacleLayout: ReadonlyArray<readonly [number, number, number, number]> = [
-  [100, 100, 160, 128], [420, 100, 176, 112], [760, 100, 144, 160], [1080, 100, 160, 128],
+  [100, 100, 160, 128], [420, 100, 176, 112], [], [1080, 100, 160, 128],
   [1400, 100, 176, 112], [1740, 100, 144, 160], [2060, 100, 160, 128], [100, 420, 160, 128],
   [2140, 420, 160, 128], [100, 740, 160, 128], [2140, 740, 160, 128], [100, 1060, 160, 128],
killedBy: world and reducer behavior re-evaluates every fixed obstacle row after module reset
statusReason: expected [ [ +0, 100, 100, 160, 128 ], …(23) ] to deeply equal [ [ +0, 100, 100, 160, 128 ], …(23) ]

[Killed] ArrayDeclaration
src/game/world.ts:7:49
 
 const obstacleLayout: ReadonlyArray<readonly [number, number, number, number]> = [
   [100, 100, 160, 128], [420, 100, 176, 112], [760, 100, 144, 160], [1080, 100, 160, 128],
-  [1400, 100, 176, 112], [1740, 100, 144, 160], [2060, 100, 160, 128], [100, 420, 160, 128],
+  [1400, 100, 176, 112], [1740, 100, 144, 160], [], [100, 420, 160, 128],
   [2140, 420, 160, 128], [100, 740, 160, 128], [2140, 740, 160, 128], [100, 1060, 160, 128],
   [2140, 1060, 160, 128], [100, 1380, 160, 128], [420, 1380, 176, 112], [760, 1380, 144, 140],
killedBy: world and reducer behavior re-evaluates every fixed obstacle row after module reset
statusReason: expected [ [ +0, 100, 100, 160, 128 ], …(23) ] to deeply equal [ [ +0, 100, 100, 160, 128 ], …(23) ]

[Killed] ArrayDeclaration
src/game/world.ts:9:73
   [100, 100, 160, 128], [420, 100, 176, 112], [760, 100, 144, 160], [1080, 100, 160, 128],
   [1400, 100, 176, 112], [1740, 100, 144, 160], [2060, 100, 160, 128], [100, 420, 160, 128],
   [2140, 420, 160, 128], [100, 740, 160, 128], [2140, 740, 160, 128], [100, 1060, 160, 128],
-  [2140, 1060, 160, 128], [100, 1380, 160, 128], [420, 1380, 176, 112], [760, 1380, 144, 140],
+  [2140, 1060, 160, 128], [100, 1380, 160, 128], [420, 1380, 176, 112], [],
   [1080, 1380, 160, 128], [1400, 1380, 176, 112], [1740, 1380, 144, 140], [2060, 1380, 160, 128],
   [400, 620, 112, 112], [1888, 620, 112, 112], [400, 940, 112, 112], [1888, 940, 112, 112],
killedBy: world and reducer behavior re-evaluates every fixed obstacle row after module reset
statusReason: expected [ [ +0, 100, 100, 160, 128 ], …(23) ] to deeply equal [ [ +0, 100, 100, 160, 128 ], …(23) ]

[Killed] ArrayDeclaration
src/game/world.ts:9:50
   [100, 100, 160, 128], [420, 100, 176, 112], [760, 100, 144, 160], [1080, 100, 160, 128],
   [1400, 100, 176, 112], [1740, 100, 144, 160], [2060, 100, 160, 128], [100, 420, 160, 128],
   [2140, 420, 160, 128], [100, 740, 160, 128], [2140, 740, 160, 128], [100, 1060, 160, 128],
-  [2140, 1060, 160, 128], [100, 1380, 160, 128], [420, 1380, 176, 112], [760, 1380, 144, 140],
+  [2140, 1060, 160, 128], [100, 1380, 160, 128], [], [760, 1380, 144, 140],
   [1080, 1380, 160, 128], [1400, 1380, 176, 112], [1740, 1380, 144, 140], [2060, 1380, 160, 128],
   [400, 620, 112, 112], [1888, 620, 112, 112], [400, 940, 112, 112], [1888, 940, 112, 112],
killedBy: world and reducer behavior re-evaluates every fixed obstacle row after module reset
statusReason: expected [ [ +0, 100, 100, 160, 128 ], …(23) ] to deeply equal [ [ +0, 100, 100, 160, 128 ], …(23) ]

[Killed] ArrayDeclaration
src/game/world.ts:11:25
   [2140, 420, 160, 128], [100, 740, 160, 128], [2140, 740, 160, 128], [100, 1060, 160, 128],
   [2140, 1060, 160, 128], [100, 1380, 160, 128], [420, 1380, 176, 112], [760, 1380, 144, 140],
   [1080, 1380, 160, 128], [1400, 1380, 176, 112], [1740, 1380, 144, 140], [2060, 1380, 160, 128],
-  [400, 620, 112, 112], [1888, 620, 112, 112], [400, 940, 112, 112], [1888, 940, 112, 112],
+  [400, 620, 112, 112], [], [400, 940, 112, 112], [1888, 940, 112, 112],
 ];
 
killedBy: world and reducer behavior re-evaluates every fixed obstacle row after module reset
statusReason: expected [ [ +0, 100, 100, 160, 128 ], …(23) ] to deeply equal [ [ +0, 100, 100, 160, 128 ], …(23) ]

[Killed] BlockStatement
src/game/world.ts:14:39
   [400, 620, 112, 112], [1888, 620, 112, 112], [400, 940, 112, 112], [1888, 940, 112, 112],
 ];
 
-function fixedObstacles(): Obstacle[] {
-  return obstacleLayout.map(([x, y, width, height], id) => ({ id, x, y, width, height }));
-}
+function fixedObstacles(): Obstacle[] {}
 
 function starAt(id: number): Star {
killedBy: mutation-gap world geometry contracts preserves every obstacle row exactly
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/game/world.ts:15:29
 ];
 
 function fixedObstacles(): Obstacle[] {
-  return obstacleLayout.map(([x, y, width, height], id) => ({ id, x, y, width, height }));
+  return obstacleLayout.map(() => undefined);
 }
 
killedBy: seeded world construction starts every valid round with exact obstacle/star quotas and stable IDs
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/game/world.ts:18:35
   return obstacleLayout.map(([x, y, width, height], id) => ({ id, x, y, width, height }));
 }
 
-function starAt(id: number): Star {
-  const group = id < 10 ? 0 : id < 20 ? 1 : 2;
-  const local = group === 0 ? id : group === 1 ? id - 10 : id - 20;
-  const count = group === 0 ? 10 : group === 1 ? 10 : 8;
-  const radius = group === 0 ? 500 : group === 1 ? 900 : 200;
-  const angle = (Math.PI * 2 * local) / count;
-  return { id, centerQ: { x: Math.round((1_200 + Math.cos(angle) * radius) * Q), y: Math.round((800 + Math.sin(angle) * radius) * Q) } };
-}
+function starAt(id: number): Star {}
 
 export function createRound(seed = FALLBACK_SEED): GameState {
killedBy: mutation-gap world geometry contracts uses the three documented star rings with stable local IDs and coordinates
statusReason: expected undefined to match object { id: +0, centerQ: { …(2) } }

[Killed] EqualityOperator
src/game/world.ts:19:17
 }
 
 function starAt(id: number): Star {
-  const group = id < 10 ? 0 : id < 20 ? 1 : 2;
+  const group = id >= 10 ? 0 : id < 20 ? 1 : 2;
   const local = group === 0 ? id : group === 1 ? id - 10 : id - 20;
   const count = group === 0 ? 10 : group === 1 ? 10 : 8;
killedBy: mutation-gap world geometry contracts uses the three documented star rings with stable local IDs and coordinates
statusReason: expected { id: +0, centerQ: { …(2) } } to match object { id: +0, centerQ: { …(2) } }

[Killed] EqualityOperator
src/game/world.ts:19:31
 }
 
 function starAt(id: number): Star {
-  const group = id < 10 ? 0 : id < 20 ? 1 : 2;
+  const group = id < 10 ? 0 : id <= 20 ? 1 : 2;
   const local = group === 0 ? id : group === 1 ? id - 10 : id - 20;
   const count = group === 0 ? 10 : group === 1 ? 10 : 8;
killedBy: mutation-gap world geometry contracts uses the three documented star rings with stable local IDs and coordinates
statusReason: expected { id: 20, centerQ: { …(2) } } to match object { id: 20, …(1) }

[Killed] ConditionalExpression
src/game/world.ts:20:17
 
 function starAt(id: number): Star {
   const group = id < 10 ? 0 : id < 20 ? 1 : 2;
-  const local = group === 0 ? id : group === 1 ? id - 10 : id - 20;
+  const local = true ? id : group === 1 ? id - 10 : id - 20;
   const count = group === 0 ? 10 : group === 1 ? 10 : 8;
   const radius = group === 0 ? 500 : group === 1 ? 900 : 200;
killedBy: mutation-gap world geometry contracts uses the three documented star rings with stable local IDs and coordinates
statusReason: expected { id: 20, …(1) } to match object { id: 20, …(1) }

[Killed] EqualityOperator
src/game/world.ts:20:17
 
 function starAt(id: number): Star {
   const group = id < 10 ? 0 : id < 20 ? 1 : 2;
-  const local = group === 0 ? id : group === 1 ? id - 10 : id - 20;
+  const local = group !== 0 ? id : group === 1 ? id - 10 : id - 20;
   const count = group === 0 ? 10 : group === 1 ? 10 : 8;
   const radius = group === 0 ? 500 : group === 1 ? 900 : 200;
killedBy: mutation-gap world geometry contracts uses the three documented star rings with stable local IDs and coordinates
statusReason: expected { id: 20, …(1) } to match object { id: 20, …(1) }

[Killed] ConditionalExpression
src/game/world.ts:21:36
 function starAt(id: number): Star {
   const group = id < 10 ? 0 : id < 20 ? 1 : 2;
   const local = group === 0 ? id : group === 1 ? id - 10 : id - 20;
-  const count = group === 0 ? 10 : group === 1 ? 10 : 8;
+  const count = group === 0 ? 10 : false ? 10 : 8;
   const radius = group === 0 ? 500 : group === 1 ? 900 : 200;
   const angle = (Math.PI * 2 * local) / count;
killedBy: seeded world construction keeps initial stars in their fixed distance bands and separated from one another
statusReason: expected 0 to be greater than 100

[Killed] ConditionalExpression
src/game/world.ts:21:17
 function starAt(id: number): Star {
   const group = id < 10 ? 0 : id < 20 ? 1 : 2;
   const local = group === 0 ? id : group === 1 ? id - 10 : id - 20;
-  const count = group === 0 ? 10 : group === 1 ? 10 : 8;
+  const count = true ? 10 : group === 1 ? 10 : 8;
   const radius = group === 0 ? 500 : group === 1 ? 900 : 200;
   const angle = (Math.PI * 2 * local) / count;
killedBy: mutation-gap world geometry contracts uses the three documented star rings with stable local IDs and coordinates
statusReason: expected { id: 27, …(1) } to match object { id: 27, …(1) }

[Killed] ConditionalExpression
src/game/world.ts:22:18
   const group = id < 10 ? 0 : id < 20 ? 1 : 2;
   const local = group === 0 ? id : group === 1 ? id - 10 : id - 20;
   const count = group === 0 ? 10 : group === 1 ? 10 : 8;
-  const radius = group === 0 ? 500 : group === 1 ? 900 : 200;
+  const radius = true ? 500 : group === 1 ? 900 : 200;
   const angle = (Math.PI * 2 * local) / count;
   return { id, centerQ: { x: Math.round((1_200 + Math.cos(angle) * radius) * Q), y: Math.round((800 + Math.sin(angle) * radius) * Q) } };
killedBy: seeded world construction keeps initial stars in their fixed distance bands and separated from one another
statusReason: expected 500 to be greater than 850

[Killed] EqualityOperator
src/game/world.ts:22:18
   const group = id < 10 ? 0 : id < 20 ? 1 : 2;
   const local = group === 0 ? id : group === 1 ? id - 10 : id - 20;
   const count = group === 0 ? 10 : group === 1 ? 10 : 8;
-  const radius = group === 0 ? 500 : group === 1 ? 900 : 200;
+  const radius = group !== 0 ? 500 : group === 1 ? 900 : 200;
   const angle = (Math.PI * 2 * local) / count;
   return { id, centerQ: { x: Math.round((1_200 + Math.cos(angle) * radius) * Q), y: Math.round((800 + Math.sin(angle) * radius) * Q) } };
killedBy: seeded world construction keeps initial stars in their fixed distance bands and separated from one another
statusReason: expected 500 to be greater than 850

[Killed] ArithmeticOperator
src/game/world.ts:23:17
   const local = group === 0 ? id : group === 1 ? id - 10 : id - 20;
   const count = group === 0 ? 10 : group === 1 ? 10 : 8;
   const radius = group === 0 ? 500 : group === 1 ? 900 : 200;
-  const angle = (Math.PI * 2 * local) / count;
+  const angle = Math.PI * 2 * local * count;
   return { id, centerQ: { x: Math.round((1_200 + Math.cos(angle) * radius) * Q), y: Math.round((800 + Math.sin(angle) * radius) * Q) } };
 }
killedBy: seeded world construction keeps initial stars in their fixed distance bands and separated from one another
statusReason: expected 0 to be greater than 100

[Killed] ArithmeticOperator
src/game/world.ts:23:18
   const local = group === 0 ? id : group === 1 ? id - 10 : id - 20;
   const count = group === 0 ? 10 : group === 1 ? 10 : 8;
   const radius = group === 0 ? 500 : group === 1 ? 900 : 200;
-  const angle = (Math.PI * 2 * local) / count;
+  const angle = (Math.PI / 2 * local) / count;
   return { id, centerQ: { x: Math.round((1_200 + Math.cos(angle) * radius) * Q), y: Math.round((800 + Math.sin(angle) * radius) * Q) } };
 }
killedBy: seeded world construction keeps initial stars in their fixed distance bands and separated from one another
statusReason: expected 78.45910202129133 to be greater than 100

[Killed] ArithmeticOperator
src/game/world.ts:24:103
   const count = group === 0 ? 10 : group === 1 ? 10 : 8;
   const radius = group === 0 ? 500 : group === 1 ? 900 : 200;
   const angle = (Math.PI * 2 * local) / count;
-  return { id, centerQ: { x: Math.round((1_200 + Math.cos(angle) * radius) * Q), y: Math.round((800 + Math.sin(angle) * radius) * Q) } };
+  return { id, centerQ: { x: Math.round((1_200 + Math.cos(angle) * radius) * Q), y: Math.round((800 + Math.sin(angle) / radius) * Q) } };
 }
 
killedBy: mutation-gap world geometry contracts uses the three documented star rings with stable local IDs and coordinates
statusReason: expected { id: 9, centerQ: { …(2) } } to match object { id: 9, centerQ: { …(2) } }

[Killed] ArithmeticOperator
src/game/world.ts:24:41
   const count = group === 0 ? 10 : group === 1 ? 10 : 8;
   const radius = group === 0 ? 500 : group === 1 ? 900 : 200;
   const angle = (Math.PI * 2 * local) / count;
-  return { id, centerQ: { x: Math.round((1_200 + Math.cos(angle) * radius) * Q), y: Math.round((800 + Math.sin(angle) * radius) * Q) } };
+  return { id, centerQ: { x: Math.round((1_200 + Math.cos(angle) * radius) / Q), y: Math.round((800 + Math.sin(angle) * radius) * Q) } };
 }
 
killedBy: seeded world construction keeps initial stars in their fixed distance bands and separated from one another
statusReason: expected 1200 to be less than or equal to 850

[Killed] BlockStatement
src/game/world.ts:27:62
   return { id, centerQ: { x: Math.round((1_200 + Math.cos(angle) * radius) * Q), y: Math.round((800 + Math.sin(angle) * radius) * Q) } };
 }
 
-export function createRound(seed = FALLBACK_SEED): GameState {
-  const rng = createRng(seed);
-  // Preserve a nonzero serializable gameplay state without letting cosmetic layout consume runtime entropy.
-  const rngState = rng.nextU32();
-  return {
-    phase: 'playing', tick: 0, rngState, player: { centerQ: { ...LIGHTHOUSE } },
-    lantern: { energyUnits: MAX_ENERGY_UNITS }, obstacles: fixedObstacles(),
-    availableStars: Array.from({ length: 28 }, (_, id) => starAt(id)), carriedStars: [],
-    bankedStars: 0, score: 0, shadows: [], nextStarId: 28, nextShadowId: 0,
-  };
-}
+export function createRound(seed = FALLBACK_SEED): GameState {}
 
killedBy: mutation-gap world geometry contracts preserves every obstacle row exactly
statusReason: Cannot read properties of undefined (reading 'obstacles')

[Killed] ObjectLiteral
src/game/world.ts:32:50
   // Preserve a nonzero serializable gameplay state without letting cosmetic layout consume runtime entropy.
   const rngState = rng.nextU32();
   return {
-    phase: 'playing', tick: 0, rngState, player: { centerQ: { ...LIGHTHOUSE } },
+    phase: 'playing', tick: 0, rngState, player: {},
     lantern: { energyUnits: MAX_ENERGY_UNITS }, obstacles: fixedObstacles(),
     availableStars: Array.from({ length: 28 }, (_, id) => starAt(id)), carriedStars: [],
killedBy: mutation-gap reducer contracts decrements ordinary shadow grace and never decrements newly spawned grace
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] ArrowFunction
src/game/world.ts:34:48
   return {
     phase: 'playing', tick: 0, rngState, player: { centerQ: { ...LIGHTHOUSE } },
     lantern: { energyUnits: MAX_ENERGY_UNITS }, obstacles: fixedObstacles(),
-    availableStars: Array.from({ length: 28 }, (_, id) => starAt(id)), carriedStars: [],
+    availableStars: Array.from({ length: 28 }, () => undefined), carriedStars: [],
     bankedStars: 0, score: 0, shadows: [], nextStarId: 28, nextShadowId: 0,
   };
killedBy: mutation-gap world geometry contracts uses the three documented star rings with stable local IDs and coordinates
statusReason: expected undefined to match object { id: +0, centerQ: { …(2) } }

[Killed] ObjectLiteral
src/game/world.ts:34:32
   return {
     phase: 'playing', tick: 0, rngState, player: { centerQ: { ...LIGHTHOUSE } },
     lantern: { energyUnits: MAX_ENERGY_UNITS }, obstacles: fixedObstacles(),
-    availableStars: Array.from({ length: 28 }, (_, id) => starAt(id)), carriedStars: [],
+    availableStars: Array.from({}, (_, id) => starAt(id)), carriedStars: [],
     bankedStars: 0, score: 0, shadows: [], nextStarId: 28, nextShadowId: 0,
   };
killedBy: mutation-gap world geometry contracts uses the three documented star rings with stable local IDs and coordinates
statusReason: expected undefined to match object { id: +0, centerQ: { …(2) } }
