[Killed] ConditionalExpression
src/platform/input.ts:2:49
 import { Q } from '../game/constants';
-function trunc0(value: number): number { return value < 0 ? Math.ceil(value) : Math.floor(value); }
+function trunc0(value: number): number { return true ? Math.ceil(value) : Math.floor(value); }
 function isqrt(value: number): number { return Math.floor(Math.sqrt(value)); }
 export function quantizeThumbVector(dx: number, dy: number): { x: number; y: number } {
killedBy: mutation-gap thumb quantization contracts normalizes every cardinal and diagonal direction, including negatives
statusReason: expected { x: 45198, y: 47458 } to deeply equal { x: 45197, y: 47457 }

[Killed] BlockStatement
src/platform/input.ts:2:40
 import { Q } from '../game/constants';
-function trunc0(value: number): number { return value < 0 ? Math.ceil(value) : Math.floor(value); }
+function trunc0(value: number): number {}
 function isqrt(value: number): number { return Math.floor(Math.sqrt(value)); }
 export function quantizeThumbVector(dx: number, dy: number): { x: number; y: number } {
killedBy: mutation-gap thumb quantization contracts normalizes every cardinal and diagonal direction, including negatives
statusReason: expected { x: undefined, y: undefined } to deeply equal { x: 65536, y: +0 }

[Killed] BlockStatement
src/platform/input.ts:3:39
 import { Q } from '../game/constants';
 function trunc0(value: number): number { return value < 0 ? Math.ceil(value) : Math.floor(value); }
-function isqrt(value: number): number { return Math.floor(Math.sqrt(value)); }
+function isqrt(value: number): number {}
 export function quantizeThumbVector(dx: number, dy: number): { x: number; y: number } {
   if (dx * dx + dy * dy <= (12 * 256) ** 2) return { x: 0, y: 0 };
killedBy: mutation-gap thumb quantization contracts normalizes every cardinal and diagonal direction, including negatives
statusReason: expected { x: NaN, y: NaN } to deeply equal { x: 65536, y: +0 }

[Killed] BlockStatement
src/platform/input.ts:4:87
 import { Q } from '../game/constants';
 function trunc0(value: number): number { return value < 0 ? Math.ceil(value) : Math.floor(value); }
 function isqrt(value: number): number { return Math.floor(Math.sqrt(value)); }
-export function quantizeThumbVector(dx: number, dy: number): { x: number; y: number } {
-  if (dx * dx + dy * dy <= (12 * 256) ** 2) return { x: 0, y: 0 };
-  let x = dx; let y = dy; const length = isqrt(x * x + y * y); const maximum = 44 * 256;
-  if (length > maximum) { x = trunc0((x * maximum) / length); y = trunc0((y * maximum) / length); }
-  const normalized = isqrt(x * x + y * y);
-  return { x: trunc0((x * Q) / normalized), y: trunc0((y * Q) / normalized) };
-}
+export function quantizeThumbVector(dx: number, dy: number): { x: number; y: number } {}
 
killedBy: mutation-gap thumb quantization contracts normalizes every cardinal and diagonal direction, including negatives
statusReason: expected undefined to deeply equal { x: 65536, y: +0 }

[Killed] ArithmeticOperator
src/platform/input.ts:5:7
 function trunc0(value: number): number { return value < 0 ? Math.ceil(value) : Math.floor(value); }
 function isqrt(value: number): number { return Math.floor(Math.sqrt(value)); }
 export function quantizeThumbVector(dx: number, dy: number): { x: number; y: number } {
-  if (dx * dx + dy * dy <= (12 * 256) ** 2) return { x: 0, y: 0 };
+  if (dx * dx - dy * dy <= (12 * 256) ** 2) return { x: 0, y: 0 };
   let x = dx; let y = dy; const length = isqrt(x * x + y * y); const maximum = 44 * 256;
   if (length > maximum) { x = trunc0((x * maximum) / length); y = trunc0((y * maximum) / length); }
killedBy: quantized thumb control uses truncation toward zero for negative quantized pointer coordinates
statusReason: expected 0 to be less than 0

[Killed] ArithmeticOperator
src/platform/input.ts:5:17
 function trunc0(value: number): number { return value < 0 ? Math.ceil(value) : Math.floor(value); }
 function isqrt(value: number): number { return Math.floor(Math.sqrt(value)); }
 export function quantizeThumbVector(dx: number, dy: number): { x: number; y: number } {
-  if (dx * dx + dy * dy <= (12 * 256) ** 2) return { x: 0, y: 0 };
+  if (dx * dx + dy / dy <= (12 * 256) ** 2) return { x: 0, y: 0 };
   let x = dx; let y = dy; const length = isqrt(x * x + y * y); const maximum = 44 * 256;
   if (length > maximum) { x = trunc0((x * maximum) / length); y = trunc0((y * maximum) / length); }
killedBy: platform boundaries keeps exact-radius thumb quantization stable
statusReason: expected { x: NaN, y: NaN } to deeply equal { x: +0, y: +0 }

[Killed] ArithmeticOperator
src/platform/input.ts:6:80
 function isqrt(value: number): number { return Math.floor(Math.sqrt(value)); }
 export function quantizeThumbVector(dx: number, dy: number): { x: number; y: number } {
   if (dx * dx + dy * dy <= (12 * 256) ** 2) return { x: 0, y: 0 };
-  let x = dx; let y = dy; const length = isqrt(x * x + y * y); const maximum = 44 * 256;
+  let x = dx; let y = dy; const length = isqrt(x * x + y * y); const maximum = 44 / 256;
   if (length > maximum) { x = trunc0((x * maximum) / length); y = trunc0((y * maximum) / length); }
   const normalized = isqrt(x * x + y * y);
killedBy: mutation-gap thumb quantization contracts normalizes every cardinal and diagonal direction, including negatives
statusReason: expected { x: NaN, y: NaN } to deeply equal { x: 65536, y: +0 }

[Killed] ArithmeticOperator
src/platform/input.ts:6:48
 function isqrt(value: number): number { return Math.floor(Math.sqrt(value)); }
 export function quantizeThumbVector(dx: number, dy: number): { x: number; y: number } {
   if (dx * dx + dy * dy <= (12 * 256) ** 2) return { x: 0, y: 0 };
-  let x = dx; let y = dy; const length = isqrt(x * x + y * y); const maximum = 44 * 256;
+  let x = dx; let y = dy; const length = isqrt(x / x + y * y); const maximum = 44 * 256;
   if (length > maximum) { x = trunc0((x * maximum) / length); y = trunc0((y * maximum) / length); }
   const normalized = isqrt(x * x + y * y);
killedBy: mutation-gap thumb quantization contracts normalizes every cardinal and diagonal direction, including negatives
statusReason: expected { x: -58617, y: -29308 } to deeply equal { x: -58623, y: -29308 }

[Killed] BlockStatement
src/platform/input.ts:7:25
 export function quantizeThumbVector(dx: number, dy: number): { x: number; y: number } {
   if (dx * dx + dy * dy <= (12 * 256) ** 2) return { x: 0, y: 0 };
   let x = dx; let y = dy; const length = isqrt(x * x + y * y); const maximum = 44 * 256;
-  if (length > maximum) { x = trunc0((x * maximum) / length); y = trunc0((y * maximum) / length); }
+  if (length > maximum) {}
   const normalized = isqrt(x * x + y * y);
   return { x: trunc0((x * Q) / normalized), y: trunc0((y * Q) / normalized) };
killedBy: mutation-gap thumb quantization contracts normalizes every cardinal and diagonal direction, including negatives
statusReason: expected { x: -58618, y: -29309 } to deeply equal { x: -58623, y: -29308 }

[Killed] ArithmeticOperator
src/platform/input.ts:7:74
 export function quantizeThumbVector(dx: number, dy: number): { x: number; y: number } {
   if (dx * dx + dy * dy <= (12 * 256) ** 2) return { x: 0, y: 0 };
   let x = dx; let y = dy; const length = isqrt(x * x + y * y); const maximum = 44 * 256;
-  if (length > maximum) { x = trunc0((x * maximum) / length); y = trunc0((y * maximum) / length); }
+  if (length > maximum) { x = trunc0((x * maximum) / length); y = trunc0(y * maximum * length); }
   const normalized = isqrt(x * x + y * y);
   return { x: trunc0((x * Q) / normalized), y: trunc0((y * Q) / normalized) };
killedBy: mutation-gap thumb quantization contracts normalizes every cardinal and diagonal direction, including negatives
statusReason: expected { x: -0, y: -65536 } to deeply equal { x: -58623, y: -29308 }

[Killed] ArithmeticOperator
src/platform/input.ts:8:36
   if (dx * dx + dy * dy <= (12 * 256) ** 2) return { x: 0, y: 0 };
   let x = dx; let y = dy; const length = isqrt(x * x + y * y); const maximum = 44 * 256;
   if (length > maximum) { x = trunc0((x * maximum) / length); y = trunc0((y * maximum) / length); }
-  const normalized = isqrt(x * x + y * y);
+  const normalized = isqrt(x * x + y / y);
   return { x: trunc0((x * Q) / normalized), y: trunc0((y * Q) / normalized) };
 }
killedBy: mutation-gap thumb quantization contracts normalizes every cardinal and diagonal direction, including negatives
statusReason: expected { x: NaN, y: NaN } to deeply equal { x: 65536, y: +0 }

[Killed] ArithmeticOperator
src/platform/input.ts:8:28
   if (dx * dx + dy * dy <= (12 * 256) ** 2) return { x: 0, y: 0 };
   let x = dx; let y = dy; const length = isqrt(x * x + y * y); const maximum = 44 * 256;
   if (length > maximum) { x = trunc0((x * maximum) / length); y = trunc0((y * maximum) / length); }
-  const normalized = isqrt(x * x + y * y);
+  const normalized = isqrt(x * x - y * y);
   return { x: trunc0((x * Q) / normalized), y: trunc0((y * Q) / normalized) };
 }
killedBy: quantized thumb control uses truncation toward zero for negative quantized pointer coordinates
statusReason: expected NaN to be less than 0

[Killed] ArithmeticOperator
src/platform/input.ts:9:56
   let x = dx; let y = dy; const length = isqrt(x * x + y * y); const maximum = 44 * 256;
   if (length > maximum) { x = trunc0((x * maximum) / length); y = trunc0((y * maximum) / length); }
   const normalized = isqrt(x * x + y * y);
-  return { x: trunc0((x * Q) / normalized), y: trunc0((y * Q) / normalized) };
+  return { x: trunc0((x * Q) / normalized), y: trunc0((y / Q) / normalized) };
 }
 
killedBy: mutation-gap thumb quantization contracts normalizes every cardinal and diagonal direction, including negatives
statusReason: expected { x: +0, y: -0 } to deeply equal { x: +0, y: -65536 }

[Killed] ArithmeticOperator
src/platform/input.ts:9:22
   let x = dx; let y = dy; const length = isqrt(x * x + y * y); const maximum = 44 * 256;
   if (length > maximum) { x = trunc0((x * maximum) / length); y = trunc0((y * maximum) / length); }
   const normalized = isqrt(x * x + y * y);
-  return { x: trunc0((x * Q) / normalized), y: trunc0((y * Q) / normalized) };
+  return { x: trunc0(x * Q * normalized), y: trunc0((y * Q) / normalized) };
 }
 
killedBy: mutation-gap thumb quantization contracts normalizes every cardinal and diagonal direction, including negatives
statusReason: expected { x: 725849473024, y: +0 } to deeply equal { x: 65536, y: +0 }
