[Killed] BooleanLiteral
src/platform/storage.ts:2:108
 export type Preferences = { version: number; bestScore: number; muted: boolean; highContrast: boolean; reducedMotion: 'system' | 'on' | 'off' };
-export const defaults: Preferences = Object.freeze({ version: 1, bestScore: 0, muted: false, highContrast: false, reducedMotion: 'system' });
+export const defaults: Preferences = Object.freeze({ version: 1, bestScore: 0, muted: false, highContrast: true, reducedMotion: 'system' });
 const key = 'last-light:preferences:v1';
killedBy: storage schema constants and rejection re-evaluates defaults and the versioned storage key
statusReason: expected { version: 1, bestScore: +0, …(3) } to deeply equal { version: 1, bestScore: +0, …(3) }

[Killed] BooleanLiteral
src/platform/storage.ts:2:87
 export type Preferences = { version: number; bestScore: number; muted: boolean; highContrast: boolean; reducedMotion: 'system' | 'on' | 'off' };
-export const defaults: Preferences = Object.freeze({ version: 1, bestScore: 0, muted: false, highContrast: false, reducedMotion: 'system' });
+export const defaults: Preferences = Object.freeze({ version: 1, bestScore: 0, muted: true, highContrast: false, reducedMotion: 'system' });
 const key = 'last-light:preferences:v1';
killedBy: storage schema constants and rejection re-evaluates defaults and the versioned storage key
statusReason: expected { version: 1, bestScore: +0, …(3) } to deeply equal { version: 1, bestScore: +0, …(3) }
