[Killed] EqualityOperator
src/game/reducer.ts:59:111
   if (tick % 720 === 0 && next.availableStars.length + next.carriedStars.length < 28 && !next.pendingStarRespawn) next = { ...next, pendingStarRespawn: { dueTick: tick } };
   next = attemptStarRespawn(next, { currentTick: tick });
   next = spawnShadow(next, tick);
-  next = { ...next, shadows: next.shadows.map((shadow) => moveShadow(shadow, playerCenterQ, next.bankedStars, next.lantern.energyUnits > 0)) };
+  next = { ...next, shadows: next.shadows.map((shadow) => moveShadow(shadow, playerCenterQ, next.bankedStars, next.lantern.energyUnits >= 0)) };
   const picked = next.availableStars.filter((star) => next.carriedStars.length < 5 && pixels(star.centerQ, playerCenterQ) <= 34);
killedBy: mutation-gap reducer contracts collides at the inclusive radius only when the lantern is empty
statusReason: expected 'playing' to be 'lost' // Object.is equality

[Killed] ConditionalExpression
src/game/reducer.ts:59:111
   if (tick % 720 === 0 && next.availableStars.length + next.carriedStars.length < 28 && !next.pendingStarRespawn) next = { ...next, pendingStarRespawn: { dueTick: tick } };
   next = attemptStarRespawn(next, { currentTick: tick });
   next = spawnShadow(next, tick);
-  next = { ...next, shadows: next.shadows.map((shadow) => moveShadow(shadow, playerCenterQ, next.bankedStars, next.lantern.energyUnits > 0)) };
+  next = { ...next, shadows: next.shadows.map((shadow) => moveShadow(shadow, playerCenterQ, next.bankedStars, true)) };
   const picked = next.availableStars.filter((star) => next.carriedStars.length < 5 && pixels(star.centerQ, playerCenterQ) <= 34);
killedBy: mutation-gap reducer contracts collides at the inclusive radius only when the lantern is empty
statusReason: expected 'playing' to be 'lost' // Object.is equality

[Killed] LogicalOperator
src/game/reducer.ts:60:55
   next = attemptStarRespawn(next, { currentTick: tick });
   next = spawnShadow(next, tick);
   next = { ...next, shadows: next.shadows.map((shadow) => moveShadow(shadow, playerCenterQ, next.bankedStars, next.lantern.energyUnits > 0)) };
-  const picked = next.availableStars.filter((star) => next.carriedStars.length < 5 && pixels(star.centerQ, playerCenterQ) <= 34);
+  const picked = next.availableStars.filter((star) => next.carriedStars.length < 5 || pixels(star.centerQ, playerCenterQ) <= 34);
   if (pixels(playerCenterQ, LIGHTHOUSE) <= DEPOSIT_RADIUS && next.carriedStars.length) {
killedBy: mutation-gap reducer contracts decrements ordinary shadow grace and never decrements newly spawned grace
statusReason: expected 5 to be 4 // Object.is equality

[Killed] EqualityOperator
src/game/reducer.ts:60:87
   next = attemptStarRespawn(next, { currentTick: tick });
   next = spawnShadow(next, tick);
   next = { ...next, shadows: next.shadows.map((shadow) => moveShadow(shadow, playerCenterQ, next.bankedStars, next.lantern.energyUnits > 0)) };
-  const picked = next.availableStars.filter((star) => next.carriedStars.length < 5 && pixels(star.centerQ, playerCenterQ) <= 34);
+  const picked = next.availableStars.filter((star) => next.carriedStars.length < 5 && pixels(star.centerQ, playerCenterQ) < 34);
   if (pixels(playerCenterQ, LIGHTHOUSE) <= DEPOSIT_RADIUS && next.carriedStars.length) {
killedBy: mutation-gap reducer contracts picks up only within the inclusive radius and never exceeds five carried stars
statusReason: expected [] to deeply equal [ 99 ]

[Killed] BlockStatement
src/game/reducer.ts:66:31
     const depositedStars = next.carriedStars.length; const preRefillEnergyUnits = next.lantern.energyUnits;
   }
-  if (next.bankedStars >= 20) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
+  if (next.bankedStars >= 20) {}
   const collision = next.shadows.find((shadow) => shadow.graceTicks === 0 && pixels(shadow.centerQ, playerCenterQ) <= PLAYER_RADIUS + SHADOW_RADIUS);
   if (collision) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
killedBy: fixed-step reducer contract deposits, refills, scores from pre-refill energy, and wins on an overshooting goal
statusReason: expected 1635 to be 5835 // Object.is equality

[Killed] ArithmeticOperator
src/game/reducer.ts:66:72
     const depositedStars = next.carriedStars.length; const preRefillEnergyUnits = next.lantern.energyUnits;
   }
-  if (next.bankedStars >= 20) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
+  if (next.bankedStars >= 20) { next = { ...next, phase: 'won', score: next.score - scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
   const collision = next.shadows.find((shadow) => shadow.graceTicks === 0 && pixels(shadow.centerQ, playerCenterQ) <= PLAYER_RADIUS + SHADOW_RADIUS);
   if (collision) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
killedBy: fixed-step reducer contract deposits, refills, scores from pre-refill energy, and wins on an overshooting goal
statusReason: expected -2565 to be 5835 // Object.is equality

[Killed] ConditionalExpression
src/game/reducer.ts:67:78
   }
   if (next.bankedStars >= 20) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
-  const collision = next.shadows.find((shadow) => shadow.graceTicks === 0 && pixels(shadow.centerQ, playerCenterQ) <= PLAYER_RADIUS + SHADOW_RADIUS);
+  const collision = next.shadows.find((shadow) => shadow.graceTicks === 0 && true);
   if (collision) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
   next = { ...next, shadows: next.shadows.map((shadow) => shadow.graceTicks === 21 ? shadow : { ...shadow, graceTicks: Math.max(0, shadow.graceTicks - 1) }) };
killedBy: world and reducer behavior does not collide with an empty lantern when every shadow is far away
statusReason: expected 'lost' to be 'playing' // Object.is equality

[Killed] ConditionalExpression
src/game/reducer.ts:68:7
   }
   if (next.bankedStars >= 20) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
   const collision = next.shadows.find((shadow) => shadow.graceTicks === 0 && pixels(shadow.centerQ, playerCenterQ) <= PLAYER_RADIUS + SHADOW_RADIUS);
-  if (collision) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
+  if (true) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
   next = { ...next, shadows: next.shadows.map((shadow) => shadow.graceTicks === 21 ? shadow : { ...shadow, graceTicks: Math.max(0, shadow.graceTicks - 1) }) };
   return { state: next, events };
killedBy: fixed-step reducer contract increments only active ticks and drains exact integer lantern units outside safety
statusReason: expected 1 to be 60 // Object.is equality

[Killed] BlockStatement
src/game/reducer.ts:68:18
   }
   if (next.bankedStars >= 20) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
   const collision = next.shadows.find((shadow) => shadow.graceTicks === 0 && pixels(shadow.centerQ, playerCenterQ) <= PLAYER_RADIUS + SHADOW_RADIUS);
-  if (collision) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
+  if (collision) {}
   next = { ...next, shadows: next.shadows.map((shadow) => shadow.graceTicks === 21 ? shadow : { ...shadow, graceTicks: Math.max(0, shadow.graceTicks - 1) }) };
   return { state: next, events };
killedBy: mutation-gap reducer contracts collides at the inclusive radius only when the lantern is empty
statusReason: expected 'playing' to be 'lost' // Object.is equality

[Killed] EqualityOperator
src/game/reducer.ts:69:59
   if (next.bankedStars >= 20) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
   const collision = next.shadows.find((shadow) => shadow.graceTicks === 0 && pixels(shadow.centerQ, playerCenterQ) <= PLAYER_RADIUS + SHADOW_RADIUS);
   if (collision) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
-  next = { ...next, shadows: next.shadows.map((shadow) => shadow.graceTicks === 21 ? shadow : { ...shadow, graceTicks: Math.max(0, shadow.graceTicks - 1) }) };
+  next = { ...next, shadows: next.shadows.map((shadow) => shadow.graceTicks !== 21 ? shadow : { ...shadow, graceTicks: Math.max(0, shadow.graceTicks - 1) }) };
   return { state: next, events };
 }
killedBy: world and reducer behavior distinguishes exact lighthouse and repel radial boundaries
statusReason: expected 20 to be 21 // Object.is equality

[Killed] ConditionalExpression
src/game/reducer.ts:69:59
   if (next.bankedStars >= 20) { next = { ...next, phase: 'won', score: next.score + scoreWinBonus(tick) }; events.push({ kind: 'won' }); return { state: next, events }; }
   const collision = next.shadows.find((shadow) => shadow.graceTicks === 0 && pixels(shadow.centerQ, playerCenterQ) <= PLAYER_RADIUS + SHADOW_RADIUS);
   if (collision) { next = { ...next, phase: 'lost' }; events.push({ kind: 'lost' }); return { state: next, events }; }
-  next = { ...next, shadows: next.shadows.map((shadow) => shadow.graceTicks === 21 ? shadow : { ...shadow, graceTicks: Math.max(0, shadow.graceTicks - 1) }) };
+  next = { ...next, shadows: next.shadows.map((shadow) => true ? shadow : { ...shadow, graceTicks: Math.max(0, shadow.graceTicks - 1) }) };
   return { state: next, events };
 }
killedBy: mutation-gap reducer contracts decrements ordinary shadow grace and never decrements newly spawned grace
statusReason: expected 5 to be 4 // Object.is equality
