[Killed] LogicalOperator
src/game/rng.ts:16:9
     return value;
   };
   const int = (min: number, max: number): number => {
-    if (!Number.isSafeInteger(min) || !Number.isSafeInteger(max) || min > max || max - min >= 2 ** 32) throw new Error('invalid rng range');
+    if ((!Number.isSafeInteger(min) || !Number.isSafeInteger(max) || min > max) && max - min >= 2 ** 32) throw new Error('invalid rng range');
     const span = max - min + 1;
     const limit = Math.floor(0x1_0000_0000 / span) * span;
killedBy: mutation-gap RNG contracts rejects every invalid inclusive range boundary
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/game/rng.ts:20:35
     const span = max - min + 1;
     const limit = Math.floor(0x1_0000_0000 / span) * span;
     let output: number;
-    do output = nextU32(); while (output >= limit);
+    do output = nextU32(); while (output < limit);
     return min + (output % span);
   };
killedBy: RNG rejection behavior rejects an output exactly at the unbiased limit before mapping it
statusReason: expected +0 to be 3 // Object.is equality
